Repository: niccokunzmann/open-web-calendar
Catalog: open_web_calendar/translations/*/LC_MESSAGES/contributing.md.po
Languages: eo, es, it, nl, ta

source: You can improve the project yourself. Get started here.
eo: Vi mem povas plibonigi la projekton. Komencu ĉi tie.
es: Puedes mejorar el proyecto tú mismo. Empieza aquí.
it: Puoi migliorare il progetto tu stesso. Inizia qui.
nl: U kunt het project zelf verbeteren. Begin hier.
ta: திட்டத்தை நீங்களே மேம்படுத்தலாம். இங்கே தொடங்கவும்.

source: There are several ways in which you can help this project:
eo: Jen kelkaj manieroj, per kiuj vi povas helpi la projekton:
es: Hay varias maneras en las que puedes ayudar a este proyecto:
it: Ci sono diversi modi in cui puoi aiutare questo progetto:
nl: Er zijn meerdere mogelijkheden waarmee u dit project kunt helpen:
ta: இந்த திட்டத்திற்கு நீங்கள் உதவ பல வழிகள் உள்ளன:

source: [Use it](https://open-web-calendar.hosted.quelltext.eu) and [report errors](https://github.com/niccokunzmann/open-web-calendar/issues)
eo: [Uzu ĝin](https://open-web-calendar.hosted.quelltext.eu) kaj [raportu erarojn](https://github.com/niccokunzmann/open-web-calendar/issues)
es: [Utilizarlo](https://open-web-calendar.hosted.quelltext.eu) e [informe de errores](https://github.com/niccokunzmann/open-web-calendar/issues)
it: [Utilizzalo](https://open-web-calendar.hosted.quelltext.eu) e [segnala errori](https://github.com/niccokunzmann/open-web-calendar/issues)
nl: [Gebruik het](https://open-web-calendar.hosted.quelltext.eu) en [rapporteer fouten](https://github.com/niccokunzmann/open-web-calendar/issues)

source: [Fund costs - Open Collective](https://opencollective.com/open-web-calendar/)
es: [Gastos financieros - Open Collective](https://opencollective.com/open-web-calendar/)
nl: [Financiële ondersteuning in de kosten - Open Collective](https://opencollective.com/open-web-calendar/)
ta: [Fund costs - திற Collective](https://opencollective.com/open-web-calendar/)

source: [Fund sustainability - GitHub Sponsors](https://github.com/sponsors/niccokunzmann)
es: [Sostenibilidad de la financiación - Sponsors GitHub](https://github.com/sponsors/niccokunzmann)
nl: [Steun duurzaamheid - GitHub Sponsors](https://github.com/sponsors/niccokunzmann)

source: [Translate this project to your language](../dev/translate)
es: [Traducir este proyecto a su idioma](../dev/translate)
nl: [Vertaal dit project naar uw eigen taal](../dev/translate)
ta: [இந்த திட்டத்தை உங்கள் மொழியில் மொழிபெயர்க்கவும்](../dev/translate)

source: Have a look at [open issues](https://github.com/niccokunzmann/open-web-calendar/issues) e.g. those especially to get started, labeled [good first issue](https://github.com/niccokunzmann/open-web-calendar/issues?q=is%3Aissue+is%3Aopen+label%3A%22good+first+issue%22), leave a note and work on it.
eo: Rigardu [nesolvitajn problemojn](https://github.com/niccokunzmann/open-web-calendar/issues), ekz. tiujn por komencantoj kun la etikedo [good first issue](https://github.com/niccokunzmann/open-web-calendar/issues?q=is%3Aissue+is%3Aopen+label%3A%22good+first+issue%22), lasu noton, kaj prilaboru.
es: Echar un vistazo a los [temas abiertos](https://github.com/niccokunzmann/open-web-calendar/issues), por ejemplo, los mejores para empezar, etiquetados como [buen primer tema](https://github.com/niccokunzmann/open-web-calendar/issues?q=is%3Aissue+is%3Aopen+label%3A%22good+first+issue%22), deja una nota y trabaja en ello.
it: Dai un'occhiata a [problemi aperti](https://github.com/niccokunzmann/open-web-calendar/issues) ad es. quelli in particolare per iniziare, etichettati [buon primo numero](https://github.com/niccokunzmann/open-web-calendar/issues?q=is%3Aissue+is%3Aopen+label%3A%22good+first+issue %22), lascia una nota e lavoraci sopra.
nl: Neem een kijkje bij [open issues](https://github.com/niccokunzmann/open-web-calendar/issues) speciaal voor iedereen die wil starten, voeg het label [good first issue](https://github.com/niccokunzmann/open-web-calendar/issues?q=is%3Aissue+is%3Aopen+label%3A%22good+first+issue%22) toe, maak een notitie en werk er aan.
ta: [திறந்த சிக்கல்கள்](https://github.com/niccokunzmann/open-web-calendar/issues) ஐப் பாருங்கள் எ.கா. குறிப்பாக தொடங்குவதற்கு, [நல்ல முதல் பிரச்சினை](https://github.com/niccokunzmann/open-web-calendar/issues?q=is%3Aissue+is%3AOPEN+LABEL%3A%2Good+First+issue%22), ஒரு குறிப்பை விட்டுவிட்டு அதில் வேலை செய்யுங்கள்.

source: If you customized a calendar, please consider [contributing it as a template](../templates) for others to use.
es: Si has personalizado un calendario, considera la posibilidad de [aportarlo como plantilla](../templates) para que otros puedan utilizarlo.
it: Se hai personalizzato un calendario, prendi in considerazione l'idea di [contribuire come modello](../templates) affinché altri possano utilizzarlo.
nl: Indien u een kalender heeft aangepast naar uw wensen, overweegt u dan om hier een [template](../templates) van te maken, om door anderen gebruikt te kunnen worden.
ta: நீங்கள் ஒரு காலெண்டரைத் தனிப்பயனாக்கினால், தயவுசெய்து [ஒரு வார்ப்புருவாக பங்களிப்பதை](../templates) மற்றவர்கள் பயன்படுத்த கவனியுங்கள்.

source: If you are part of a company depending on the Open Web Calendar, please contact Nicco Kunzmann, the maintainer:
es: Si forma parte de una empresa que depende de Open Web Calendar, comuníquese con Nicco Kunzmann, el mantenedor:
nl: Indien u werkt bij een bedrijf die afhankelijk is van Open Web Calendar, neem dan contact op met Nicco Kunzmann, de ontwikkelaar:
ta: திறந்த வலை காலெண்டரைப் பொறுத்து நீங்கள் ஒரு நிறுவனத்தின் பகுதியாக இருந்தால், தயவுசெய்து நிக்கோ குன்ச்மேன், பராமரிப்பாளரைத் தொடர்பு கொள்ளவும்:

source: You need features added.
es: Necesita agregar funciones.
nl: Je hebt extra functies nodig.
ta: உங்களுக்கு சேர்க்கப்பட்ட நற்பொருத்தங்கள் தேவை.

source: You want to mitigate risks.
es: ¿Quiere mitigar los riesgos?
nl: U wilt de risico's beheersen.
ta: நீங்கள் அபாயங்களைத் தணிக்க விரும்புகிறீர்கள்.

source: You need add-ons or integrations.
es: Necesita complementos o integraciones.
nl: U heeft add-ons of integraties nodig.
ta: உங்களுக்கு துணை நிரல்கள் அல்லது ஒருங்கிணைப்புகள் தேவை.

source: Support plans and maintenance contracts are available.
es: Existen planes de apoyo y contratos de mantenimiento.
nl: Ondersteuning en onderhoudsabonementen zijn beschikbaar.
ta: உதவி திட்டங்கள் மற்றும் பராமரிப்பு ஒப்பந்தங்கள் கிடைக்கின்றன.

source: [![Sponsor with GitHub](https://img.shields.io/github/sponsors/niccokunzmann?logo=github&label=GitHub%20Sponsors)](https://github.com/sponsors/niccokunzmann) [![Support on Open Collective](https://img.shields.io/opencollective/all/open-web-calendar?label=support%20on%20open%20collective)](https://opencollective.com/open-web-calendar/)
nl: [![Sponsor met GitHub](https://img.shields.io/github/sponsors/niccokunzmann?logo=github&label=GitHub%20Sponsors)](https://github.com/sponsors/niccokunzmann) [![Ondersteun op Open Collective](https://img.shields.io/opencollective/all/open-web-calendar?label=support%20on%20open%20collective)](https://opencollective.com/open-web-calendar/)

source: [Set up your development environment](../dev/)
nl: [Instellen van uw ontwikkelomgeving](../dev/)

source: Ways to Contribute
nl: Manieren om bij te dragen

source: 🐛 Report Bugs
nl: 🐛 Meld bugs

source: Found a bug? Please [create an issue](https://github.com/niccokunzmann/open-web-calendar/issues) with:
nl: Een bug gevonden? Maak alstublieft een [issue](https://github.com/niccokunzmann/open-web-calendar/issues) aan met:

source: Clear description of the problem
nl: Heldere omschrijving van het probleem

source: Steps to reproduce
nl: Stappen om het probleem te kunnen reproduceren

source: Expected vs actual behavior
nl: Verwachte vs het actuele gedrag

source: 💡 Suggest Features
nl: 💡 Stel nieuwe features voor

source: Have an idea? [Open an issue](https://github.com/niccokunzmann/open-web-calendar/issues) to discuss it!
nl: Heb je een idee? [Open een issue](https://github.com/niccokunzmann/open-web-calendar/issues) om te overleggen!

source: 🔧 Code Contributions
nl: 🔧 Codecontributies

source: **Fork the repository**
nl: **Maak een fork van de repository**

source: **Create a feature branch**: `git checkout -b feature/your-feature-name`
nl: **Maak een feature branch**: `git checkout -b feature/your-feature-name`

source: **Set up development environment**: See [development documentation](../dev/)
nl: **Configureer de ontwikkelomgeving**: Zie [ontwikkeldocumentatie](../dev/)

source: **Make your changes**
nl: **Maak je wijzigingen**

source: **Run tests**
nl: **Voer de tests uit**

source: **Submit a pull request**
nl: **Verstuur een pull request**

source: 📚 Documentation
nl: 📚 Documentatie

source: Help improve our documentation by:
nl: Help onze documentatie te verbeteren door:

source: Fixing typos or unclear instructions
nl: Verbeter typefouten of wazige instructies

source: Adding examples
nl: Voeg voorbeelden toe

source: Get Help
nl: Krijg hulp

source: Questions? Check our [documentation](https://open-web-calendar.hosted.quelltext.eu) or join the [discussions](https://github.com/niccokunzmann/open-web-calendar/discussions).
nl: Vragen? Bekijk onze [documentatie](https://open-web-calendar.hosted.quelltext.eu) of meld je aan voor de [discussies](https://github.com/niccokunzmann/open-web-calendar/discussions).

source: Contribute ♥️
eo: Kontribui ♥️
es: Contribuye ♥️
it: Contribuire♥️
ta: பங்களிப்பு

source: [Fund development & maintenance - Polar](https://polar.sh/niccokunzmann/open-web-calendar)
es: [Financiar desarrollo y mantenimiento - Polar](https://polar.sh/niccokunzmann/open-web-calendar)
ta: [Fund வளர்ச்சி & maintenance - Polar](https://polar.sh/niccokunzmann/open-web-calendar)

source: Embed a highly customizable web calendar into your website using ICal source links
ta: ICAL மூல இணைப்புகளைப் பயன்படுத்தி உங்கள் வலைத்தளத்தில் மிகவும் தனிப்பயனாக்கக்கூடிய வலை காலிகையை உட்பொதிக்கவும்

source: Open Web Calendar
ta: வலை காலிகையை திற

source: Permanent link
ta: நிரந்தர இணைப்பு

source: See also:
ta: மேலும் காண்க:

source: [configure a proxy]: #ssrf-protection-with-a-proxy-server
ta: [ஒரு பதிலியை உள்ளமைக்கவும்]: #ssrf-protection-with-a-proxy-server

source: After you have set up your own server, you can [configure the behavior](../configure).
ta: உங்கள் சொந்த சேவையகத்தை அமைத்தபிறகு, நீங்கள் [நடத்தை உள்ளமைக்கலாம்](../configure).

source: Python Package
ta: பைதான் தொகுப்பு

source: OWC_SPECIFICATION
ta: ஒடபுள்யுசி_விவரக்குறிப்பு

source: Examples:
ta: எடுத்துக்காட்டுகள்:

source: Further Configuration
ta: மேலும் உள்ளமைவு

source: [Donate using Open Collective](https://opencollective.com/open-web-calendar/)
eo: [Donacu per Open Collective](https://opencollective.com/open-web-calendar/)
it: [Fai una donazione utilizzando Open Collective](https://opencollective.com/open-web-calendar/)

source: [Fund specific issues with Polar](https://polar.sh/niccokunzmann/open-web-calendar)
eo: [Financu specifajn problemojn per Polar](https://polar.sh/niccokunzmann/open-web-calendar)
it: [Problemi specifici sui fondi con Polar](https://polar.sh/niccokunzmann/open-web-calendar)

source: [Donate using GitHub Sponsors](https://github.com/sponsors/niccokunzmann)
eo: [Donacu per GitHub Sponsors](https://github.com/sponsors/niccokunzmann)
it: [Fai una donazione utilizzando gli sponsor GitHub](https://github.com/sponsors/niccokunzmann)

source: If you customized a calendar, please consider [contributing it as a template](templates.md) for others to use.
eo: Se vi tajlis kalendaron, bonvolu konsideri [kontribui ĝin kiel ŝablonon](templates.md) por aliuloj.

source: If you are part of a company and you would like to commission work, please get in touch with Nicco Kunzmann.
eo: Se vi estas parto de firmao kaj volas komisii laboron, bonvolu kontakti Nicco Kunzmann.
it: Se fai parte di un'azienda e desideri commissionare dei lavori, contatta Nicco Kunzmann.

source: [Translate this project](dev/translate.md)
eo: [Traduki ĉi tiun projekton](dev/translate.md)

source: [Translate this project](../dev/translate)
it: [Traduci questo progetto](../dev/translate)
