Repository: niccokunzmann/open-web-calendar
Catalog: open_web_calendar/translations/*/LC_MESSAGES/index.md.po
Languages: cs, eo, es, hr, sk, uk

source: Customize Your Own Online Calendar Display
es: Personalice tu propio calendario en línea
uk: Налаштуйте свій власний онлайн-календар

source: See the features or try the Open Web Calendar yourself!
cs: Prohlédněte si funkce nebo si sami vyzkoušejte Open Web Calendar!
eo: Vidu la funkciojn, aŭ provu mem la Malfermitan Retan Kalendaron!
es: ¡Mira las funciones o prueba tu mismo Calendario web abierto!
hr: Pogledaj značajke ili isprobaj Open Web Calendar!
sk: Pozrite si funkcie alebo vyskúšajte Open Web Calendar sami!
uk: Перегляньте функції або спробуйте Open Web Calendar самостійно!

source: A highly flexible calendar display for your website.
cs: Vysoce flexibilní zobrazení kalendáře pro Váš web.
eo: Tre adaptebla kalendara vido por via retpaĝo.
es: Un calendario muy flexible para su página web.
hr: Vrlo fleksibilan prikaz kalendara za tvoju web stranicu.
sk: Vysoko flexibilný kalendár pre vaše webové stránky.
uk: Дуже гнучкий дисплей календаря для вашого веб-сайту.

source: Give a calendar your personal touch within minutes!
cs: Dejte kalendáři osobitý vzhled během několika minut!
eo: Facile adaptu la kalendaron laŭ via gusto!
es: ¡Da un toque personal a tu calendario en cuestión de minutos!
hr: Dizajniraj vlastiti kalendar u roku od par minuta!
sk: Dajte svoj osobný dotyk do niekoľkých minút!
uk: Надайте календарю індивідуальність за лічені хвилини!

source: **[Try it out now!](https://open-web-calendar.hosted.quelltext.eu)**
cs: **[Vyzkoušejte nyní!](https://open-web-calendar.hosted.quelltext.eu)**
eo: **[Provu ĝin nun!](https://open-web-calendar.hosted.quelltext.eu)**
es: **[¡Pruébalo ahora!](https://open-web-calendar.hosted.quelltext.eu)**
hr: **[Isprobaj!](https://open-web-calendar.hosted.quelltext.eu)**
sk: **[Try it now!](https://open-web-calendar.hosted.quelltext.eu)**
uk: **[Спробуйте зараз!](https://open-web-calendar.hosted.quelltext.eu)**

source: Features
cs: Vlastnosti
eo: Funkcioj
es: Características
hr: Značajke
sk: Vzhľad
uk: особливості

source: Instant Event Syncing
cs: Instantní synchronizace událostí
eo: Tuja sinkronigado de eventoj
es: Sincronización instantánea de eventos
hr: Trenutno sinkroniziranje događaja
uk: Миттєва синхронізація подій

source: Embed with an HTML snippet
cs: Vložení pomocí HTML kódu
eo: Enmeti per HTML-kodaĵo
es: Insertar con un fragmento HTML
hr: Ugradi s HTML isječkom
sk: Vloženie s HTML snippet
uk: Вставити за допомогою фрагмента HTML

source: Desktop and Mobile
cs: Počítač a mobil
eo: Por labortabloj kaj poŝaparatoj
es: Escritorio y móvil
hr: Desktop i mobitel
sk: Plocha a mobil
uk: Настільні та мобільні пристрої

source: Multi-Language Support
cs: Podpora více jazyků
eo: Subteno de pluraj lingvoj
es: Soporte en varios idiomas
hr: Višejezična podrška
sk: Podpora viacerých jazykov
uk: Багатомовна підтримка

source: Fixed and Automatic Timezone
cs: Pevné a automatické časové pásmo
eo: Fiksitaj aŭ aŭtomataj horzonoj
es: Zona horaria fija y automática
hr: Fiksna i automatska vremenska zona
sk: Opravený a automatický časzóna
uk: Фіксований і автоматичний часовий пояс

source: Easy Editing
cs: Snadné úpravy
eo: Facila modifado
es: Fácil edición
hr: Jednostavno uređivanje
sk: Jednoduchá úprava
uk: Легке редагування

source: Designs To Choose
cs: Designy
eo: Elekteblaj ŝablonoj
es: Diseños para elegir
hr: Izbor izgleda
sk: Dizajny na výber
uk: Дизайни на вибір

source: Multiple Calendar Sources
cs: Více zdrojů kalendáře
eo: Pluraj kalendaraj fontoj
es: Múltiples fuentes de calendario
hr: Višebrojni izvori kalendara
sk: Zdroje viacerých kalendárov
uk: Кілька джерел календаря

source: Style per Calendar, Category and more
cs: Styl pro kalendář, kategorie a další
eo: Stiloj por kalendaro, kategorio kaj plu
es: Estilo por Calendario, Categoría y más
hr: Stilovi za kalendare, kategorije i još više
sk: Štýl na kalendár, kategórie a ďalšie
uk: Стиль для календаря, категорії тощо

source: Custom CSS
cs: Vlastní CSS
eo: Propra CSS
es: CSS personalizado
hr: Prilagođeni CSS
sk: Vlastné CSS
uk: Спеціальний CSS

source: Day, Week, Month, Agenda
cs: Den, týden, měsíc, rozvrh
eo: Tago, semajno, monato, tagordo
es: Día, Semana, Mes, Agenda
hr: Dan, tjedan, mjesec, dnevni red
sk: Deň, týždeň, mesiac, agenda
uk: День, тиждень, місяць, порядок денний

source: Work Week
cs: Pracovní týden
eo: Laborsemajno
es: Semana laboral
hr: Radni tjedan
sk: Pracovný týždeň
uk: робочий тиждень

source: Custom Date & Time Range
cs: Vlastní datum a časový rozsah
eo: Propra dato-tempa intervalo
es: Intervalo de fechas y horas personalizado
hr: Prilagođeni raspon datuma i vremena
sk: Vlastný dátum a časový rozsah
uk: Спеціальний діапазон дат і часу

source: Custom Title & Icon
cs: Vlastní název a ikona
eo: Propraj titolo &amp; piktogramo
es: Título e icono personalizados
hr: Prilagođeni naslov i ikona
sk: Vlastný názov &amp; Icon
uk: Спеціальний заголовок і значок

source: Click on Event Location
cs: Kliknutí na místo konání akce
eo: Alklaki eventan lokon
es: Haga clic en ubicación del evento
hr: Prikaz mjesta događaja
sk: Kliknite na miesto udalosti
uk: Натисніть Місце події

source: Styled Event Descriptions
cs: Stylované popisy akcí
eo: Stilaj eventaj priskriboj
es: Descripciones con estilo de eventos
hr: Stilizirani opisi događaja
sk: Popis udalosti
uk: Стильні описи подій

source: FOSS - No Vendor Lock-In
cs: FOSS - Žádné proprietární uzamčení
eo: Libera malfermitkoda programo – sen limigo de vendinto
es: FOSS: sin dependencia del proveedor
hr: FOSS – Bez ovisnosti o dobavljaču
sk: FOSS - žiadny dodávateľ Lock-In
uk: FOSS - відсутність блокування постачальника

source: Subscribe Link
cs: Odkaz pro odběr
eo: Abona hiperligo
es: Enlace para suscribirse
hr: Poveznica za pretplatu
sk: Prihlásiť Link
uk: Посилання для підписки

source: Community and Paid Support
cs: Komunita a placená podpora
eo: Komunuma kaj porpaga helpo
es: Apoyo comunitario y retribuido
hr: Zajednica i naplativa podrška
sk: Komunita a platená podpora
uk: Спільнота та платна підтримка

source: [See Examples](templates)
es: [Ver ejemplos](templates)
uk: [Див. приклади](templates)

source: [Hosted](https://open-web-calendar.hosted.quelltext.eu) and [Self-Hosted](host/self)
es: [Alojado](https://open-web-calendar.hosted.quelltext.eu) y [Autoalojado](host/self)
uk: [Розміщений](https://open-web-calendar.hosted.quelltext.eu) і [Розміщений](host/self)

source: [Developer API](dev/api)
es: [Desarrollador de la API](dev/api)
uk: [API розробника](dev/api)

source: Embed a highly customizable web calendar into your website using ICal source links
eo: Metu tre adapteblan retan kalendaron en vian retpaĝon per hiperligoj al iCal-fontoj
sk: Vložte vysoko prispôsobiteľný web kalendár do vašich webových stránok pomocou ICal zdrojových odkazov
uk: Вставте веб-календар із широкими можливостями налаштування на свій веб-сайт за допомогою посилань на джерело ICal

source: Open Web Calendar
eo: Malfermita Reta Kalendaro
sk: Otvoriť Web kalendár
uk: Відкрийте веб-календар

source: Permanent link
eo: Daŭra hiperligo
sk: Permanentný odkaz
uk: Постійне посилання

source: See also:
eo: Vidu ankaŭ:
uk: Дивіться також:

source: Further Configuration
eo: Pliaj agordoj
uk: Подальша конфігурація

source: Python Package
eo: Python-pako
uk: Пакет Python

source: After you have set up your own server, you can [configure the behavior](../configure).
uk: Після налаштування власного сервера ви можете [налаштувати поведінку](../configure).

source: Examples:
uk: Приклади:

source: When you try to access a forbidden calendar with the local `open-web-calendar`, e.q. `http://172.16.0.1/calendar.ics`, you will see this error message:
uk: Коли ви намагаєтеся отримати доступ до забороненого календаря за допомогою локального `open-web-calendar`, e.q. `http://172.16.0.1/calendar.ics`, ви побачите таке повідомлення про помилку:

source: 403 Client Error: Forbidden for url: http://172.16.0.1/calendar.ics
uk: 403 Помилка клієнта: заборонено для url: http://172.16.0.1/calendar.ics

source: Getting Started
cs: Začínáme

source: [See Examples](templates.md)
cs: [Viz příklady](templates.md)

source: [Hosted](https://open-web-calendar.hosted.quelltext.eu) and [Self-Hosted](host/self.md)
cs: [Hostováno](https://open-web-calendar.hosted.quelltext.eu) a [Vlastní-hosting](host/self.md)

source: [Developer API](dev/api.md)
cs: [Vývojářské API](dev/api.md)
