Repository: niccokunzmann/open-web-calendar
Catalog: open_web_calendar/translations/*/LC_MESSAGES/templates.md.po
Languages: de, es, hr

source: Play with a variety of Calendars for your own project.
de: Probiere eine Auswahl an Kalendern für Dein eigenes Projekt.
es: Prueba una selección de calendarios para tu propio proyecto.
hr: Isprobaj razne kalendare za vlastiti projekt.

source: Examples
de: Beispiele
es: Ejemplos
hr: Primjeri

source: Are you proud of your calendar? Share it here!
de: Bist du stolz auf Deinen Kalender? Teile ihn hier!
es: ¿Está orgulloso de su calendario? ¡Compártelo aquí!
hr: Jesi li ponosan/na na svoj kalendar? Dijeli ga ovdje!

source: Mobile One Day Calendar Feed
de: Mobile Tagesanzeige
es: Feed diario para el calendario móvil
hr: Jednodnevni kalendar za mobitel

source: Here is an example of a one day view of a Christmas day:
de: Dieses Beispiel zeigt nur einen Tag an Weihnachten:
es: A continuación se muestra un ejemplo de una vista de un día de Navidad:
hr: Primjer jednodnevnog prikaza na Božić:

source: Modifications:
de: Anpassungen:
es: Cambios:
hr: Prilagodbe:

source: start and end time
de: Start- und Endzeit
es: hora de inicio y fin
hr: vrijeme početka i završetka

source: fixed date
de: Festes Datum
es: Fecha fijada
hr: fiksni datum

source: Events Hosted as a Tor Hidden Service
de: Termine von einem versteckten Tor-Dienst
es: Eventos alojados como servicio oculto de Tor
hr: Hosting događaja kao skrivena Tor usluga

source: timezone
de: Zeitzone
es: zona horaria
hr: vremenska zona

source: Free and Busy
de: Frei und Belegt
es: Libre y ocupado
hr: Slobodan i zaposlen

source: You can change the design based on whether you are free or busy.
de: Du kannst das Design abhängig davon anpassen, ob die frei hast oder nicht.
es: Puedes cambiar el diseño en función de si estás libre u ocupado.
hr: Promijeni dizajn ovisno o tome jesi li slobodan/na ili zaposlen/a.

source: This calendar has changed CSS so that the background is green and the events are either orange or red.
de: Dieser Kalender hat ein verändertes CSS, sodass der Hintergrund grün ist und die Termine entweder orange oder rot.
es: Este calendario ha cambiado el CSS para que el fondo sea verde y los eventos naranjas o rojos.
hr: Ovaj je kalendar promijenio CSS tako da je pozadina zelena, a događaji narančasti ili crveni.

source: Contribute Examples!
de: Trage Beispiele bei!
es: ¡Contribuye con ejemplos!
hr: Doprinesi primjere!

source: If you want to add another example or showcase your calendar, this is the place. You can **contact us** with the link of the calendar e.g. in an [issue](https://github.com/niccokunzmann/open-web-calendar/issues).
de: Wenn du ein Beispiel hinzufügen magst, um deinen Kalender zu zeigen, ist hier der Ort. Du kannst uns mit dem Link zum Kalender **kontaktieren**, z.B. in einer [Meldung (issue)](https://github.com/niccokunzmann/open-web-calendar/issues).
es: Si quieres añadir otro ejemplo o mostrar tu calendario, este es el lugar. Puedes **contactar con nosotros** con el enlace del calendario, o por ejemplo, en un [problema](https://github.com/niccokunzmann/open-web-calendar/issues).
hr: Ako želiš dodati još jedan primjer ili prikazati svoj kalendar, ovo je mjesto za to. **Kontaktiraj nas** s poveznicom na kalendar, npr. u [problemu](https://github.com/niccokunzmann/open-web-calendar/issues).

source: You can **edit the page** yourself:
de: Du kannst auch **die Seite selbst editieren**:
es: Puedes **editar la página** tu mismo:
hr: Ako želiš, možeš **urediti stranicu**:

source: Place all required `.ics` files in the [calendars](https://github.com/niccokunzmann/open-web-calendar/tree/master/docs/assets/calendars) directory.
de: Plaziere alle nötigen `.ics`-Dateien in dem Ordner [calendars](https://github.com/niccokunzmann/open-web-calendar/tree/master/docs/assets/calendars).
es: Coloca todos los archivos `.ics` necesarios en el directorio [calendarios](https://github.com/niccokunzmann/open-web-calendar/tree/master/docs/assets/calendars).
hr: Postavi sve potrebne `.ics` datoteke u mapu [kalendara](https://github.com/niccokunzmann/open-web-calendar/tree/master/docs/assets/calendars).

source: Download the specification of the calendar. And add it to the [templates](https://github.com/niccokunzmann/open-web-calendar/tree/master/docs/assets/templates) directory.
de: Lade die Spezifikation vom Kalender herunter und füge sie zum Ordner [templates](https://github.com/niccokunzmann/open-web-calendar/tree/master/docs/assets/templates) hinzu.
es: Descarga la especificación del calendario. Y añádalo al directorio [plantillas](https://github.com/niccokunzmann/open-web-calendar/tree/master/docs/assets/templates).
hr: Preuzmi specifikaciju kalendara i dodaj je u mapu [predložaka](https://github.com/niccokunzmann/open-web-calendar/tree/master/docs/assets/templates).

source: For an international calendar, you can allow choosing the time zone that the events are displayed in.
de: Für einen internationalen Kalender kannst du die Zeitzone ändern, in der die Termine angezeigt werden.
es: Para un calendario internacional, puedes permitir elegir la zona horaria en la que se muestran los eventos.
hr: Za međunarodni kalendar možeš dozvoliti biranje vremenske zone u kojoj se događaji prikazuju.

source: Choose Timezones
de: Zeitzonen auswählen
es: Elegir zonas horarias
hr: Odaberi vremenske zone

source: <select id="timezoneOption"><option value="America/New_York">New York</option><option value="Europe/London">London</option><option value="Asia/Singapore">Singapore</option><option value="">My Local Time Zone</option></select>
de: <select id="timezoneOption"><option value="America/New_York">New York</option><option value="Europe/London">London</option><option value="Asia/Singapore">Singapur</option><option value="">Meine Lokale Zeitzone</option></select>
es: <select id="timezoneOption"><option value="America/New_York">Nueva York</option><option value="Europe/London">Londres</option><option value="Asia/Singapore">Singapur</option><option value="">Mi huso horario local</option></select>
hr: <select id="timezoneOption"><option value="America/New_York">New York</option><option value="Europe/London">London</option><option value="Asia/Singapore">Singapore</option><option value="">Moja lokalna vremenska zona</option></select>

source: We have prepared a variety of different styles so you can edit them to your needs. For each style, you can edit the calendar and shape is as you need it. If you are inspired, you can also just head over and [start from scratch](https://open-web-calendar.hosted.quelltext.eu).
de: Wir haben eine Auswahl an verschienen Designs bereitgestellt. Diese kannst Du an Deine Bedürfnisse anpassen. Wenn Du inspiriert bist, dann kannst du auch einfach [mit einem leeren Kalender anfangen](https://open-web-calendar.hosted.quelltext.eu).
es: Hemos preparado una variedad de estilos diferentes para que puedas editarlos según tus necesidades. Para cada estilo, puedes editar el calendario y darle la forma que necesites. Si te sientes inspirado, también puedes simplemente [empezar desde cero](https://open-web-calendar.hosted.quelltext.eu).
hr: Pripremili smo niz različitih stilova koje možeš prilagoditi svojim potrebama. Za svaki stil možeš urediti kalendar i oblik kako ti odgovara. Ako si inspiriran/a također možeš [početi s novim kalendarom](https://open-web-calendar.hosted.quelltext.eu).

source: <a href="https://open-web-calendar.hosted.quelltext.eu/index.html?specification_url=https://open-web-calendar.quelltext.eu/assets/templates/family-planning.json" target="_blank">Edit the calendar</a>
es: <a href="https://open-web-calendar.hosted.quelltext.eu/index.html?specification_url=https://open-web-calendar.quelltext.eu/assets/templates/family-planning.json" target="_blank">Editar el calendario</a>

source: <a href="https://open-web-calendar.hosted.quelltext.eu/index.html?specification_url=https://open-web-calendar.quelltext.eu/assets/templates/timezone-example.json" target="_blank">Edit the calendar</a>
es: <a href="https://open-web-calendar.hosted.quelltext.eu/index.html?specification_url=https://open-web-calendar.quelltext.eu/assets/templates/timezone-example.json" target="_blank">Editar el calendario</a>
hr: <a href="https://open-web-calendar.hosted.quelltext.eu/index.html?specification_url=https://open-web-calendar.quelltext.eu/assets/templates/timezone-example.json" target="_blank">Uredi kalendar</a>

source: <a href="https://open-web-calendar.hosted.quelltext.eu/index.html?specification_url=https://open-web-calendar.quelltext.eu/assets/templates/free-and-busy.json" target="_blank">Edit the calendar</a>
es: <a href="https://open-web-calendar.hosted.quelltext.eu/index.html?specification_url=https://open-web-calendar.quelltext.eu/assets/templates/free-and-busy.json" target="_blank">Editar el calendario</a>

source: [proxy parameters](../host/configure#ssrf-protection-with-a-proxy-server)
de: [Proxy-Parameter](../host/configure#ssrf-protection-with-a-proxy-server)
es: [parámetros del proxy](../host/configure#ssrf-protection-with-a-proxy-server)
hr: [parameteri proksi servera](../host/configure#ssrf-protection-with-a-proxy-server)

source: Calendar
de: Kalender
es: Calendario
hr: Kalendar

source: Specification
de: Spezifikation
es: Especificaciones
hr: Specifikacija

source: Multiple Calendars
de: Mehrere Kalender
es: Calendarios múltiples
hr: Višebrojni kalendari

source: You can embed several calendars into one view. In this example, we show different rooms in an office.
de: Du kannst mehrere Kalender zusammen ansehen. Dieses Beispiel zeigt verschiedene Räume in einem Büro.
es: Puede insertar varios calendarios en una sola vista. En este ejemplo, mostramos diferentes estancias de una oficina.
hr: Možeš ugraditi nekoliko kalendara u jedan prikaz. U ovom primjeru prikazujemo različite prostorije u jednom uredu.

source: <a href="https://open-web-calendar.hosted.quelltext.eu/index.html?specification_url=https://open-web-calendar.quelltext.eu/assets/templates/rooms.json" target="_blank">Edit the calendar</a>
de: <a href="https://open-web-calendar.hosted.quelltext.eu/index.html?specification_url=https://open-web-calendar.quelltext.eu/assets/templates/rooms.json" target="_blank">Kalender anpassen</a>
es: <a href="https://open-web-calendar.hosted.quelltext.eu/index.html?specification_url=https://open-web-calendar.quelltext.eu/assets/templates/rooms.json" target="_blank">Modificar el calendario</a>
hr: <a href="https://open-web-calendar.hosted.quelltext.eu/index.html?specification_url=https://open-web-calendar.quelltext.eu/assets/templates/rooms.json" target="_blank">Uredi kalendar</a>

source: This is also useful if you have multiple calendar sources - be it different places, clubs, applications or organizations.
de: Das ist auch nützlich, wenn Du mehere Kalenderquellen hast wie z.B. Orte, Klubs, Anwendungen oder Organisationen.
es: Esto también es útil si tienes múltiples fuentes de calendario, ya sean diferentes lugares, clubes, aplicaciones u organizaciones.
hr: Ovo je također korisno ako imaš više izvora kalendara – bilo da se radi o različitim mjestima, klubovima, aplikacijama ili organizacijama.

source: hours
de: Stunden
es: horas
hr: sati

source: tab
de: Ansicht
es: pestaña
hr: registar

source: <iframe class="open-web-calendar" id="" style="background:url('/assets/img/circular-loader.gif') center center no-repeat; border-radius: 10px;" src="https://open-web-calendar.hosted.quelltext.eu/calendar.html?specification_url=https://open-web-calendar.quelltext.eu/assets/templates/rooms.json&" sandbox="allow-scripts allow-same-origin allow-top-navigation" allowTransparency="true" scrolling="no" frameborder="0" height="600px" width="100%"></iframe>
es: <iframe class="open-web-calendar" id="" style="background:url('/assets/img/circular-loader.gif') center center no-repeat; border-radius: 10px;" src="https://open-web-calendar.hosted.quelltext.eu/calendar.html?specification_url=https://open-web-calendar.quelltext.eu/assets/templates/rooms.json&amp;" sandbox="allow-scripts allow-same-origin allow-top-navigation" allowtransparency="true" scrolling="no" frameborder="0" height="600px" width="100%"></iframe>
