Repository: niccokunzmann/open-web-calendar
Catalog: open_web_calendar/translations/*/LC_MESSAGES/host/configure.md.po
Languages: de, es, ta, uk

source: The [Squid] Proxy and Cache is flexible and configurable. You can use it in front of the Open Web Calendar to configure access and customize caching.
de: [Squid] ist ein Proxy und Cache, flexibel ein einstellbar. Du kannst ihn vor den Offenen Web-Kalender schalten, um Zugriff und Caching einzustellen.
uk: Проксі та кеш [Squid] є гнучкими та налаштовуються. Ви можете використовувати його перед відкритим веб-календарем, щоб налаштувати доступ і налаштувати кешування.

source: After you have installed the [Squid] Proxy, add this file into the `conf.d` directory. Squid will load it automatically then.
de: Nachdem Du den [Squid] Proxy installiert hast, füge diese Datei in das `conf.d`-Verzeichnis ein. Squid wird diese dann beim Start laden.
uk: Після встановлення проксі-сервера [Squid] додайте цей файл до каталогу `conf.d`. Тоді Squid автоматично завантажить його.

source: In Linux, create `/etc/squid/conf.d/open-web-calendar.conf`:
de: In Linux, erstelle `/etc/squid/conf.d/open-web-calendar.conf`:
uk: У Linux створіть `/etc/squid/conf.d/open-web-calendar.conf`:

source: The list above denies the Open Web Calendar access to all known local/internal networks. If you have your own local network (IPv4 or IPv6), add it to the list above to be sure.
de: Diese Liste verweigert dem Offenen Web-Kalender Zugriff auf lokale und interne Netzwerke. Wenn Du andere lokale Netzwerke hast (IPv4 oder IPv6), dann füge sie der Liste hinzu.
uk: Наведений вище список забороняє Open Web Calendar доступ до всіх відомих локальних/внутрішніх мереж. Якщо у вас є власна локальна мережа (IPv4 або IPv6), додайте її до списку вище, щоб переконатися.

source: On Linux, you can install the file with this command:
de: Auf Linux kannst du diese Datei mit diesem Kommando installieren:
uk: У Linux ви можете встановити файл за допомогою цієї команди:

source: Then, restart the squid proxy.
de: Dann starte den Squid Proxy neu.
uk: Потім перезапустіть проксі squid.

source: Set the environment variables to tell the Open Web Calendar to use the Squid proxy installed on `localhost`. Setting this variable changes depending on how you run the Open Web Calendar.
de: Setze die Umgebungsvariablen, um dem Offenen Web-Kalender mitzuteilen, dass er den Squid Proxy benutzen soll, der auf `localhost` läuft. Wie genau diese Variable gesetzt wird, unterscheidet sich je nach dem, wie der Offene Web-Kalender ausgeführt wird.
uk: Встановіть змінні середовища, щоб вказати Open Web Calendar використовувати проксі-сервер Squid, встановлений на `localhost`. Налаштування цієї змінної змінюється залежно від того, як ви запускаєте Open Web Calendar.

source: If you use the [Python Setup][1], you can set the environment variables for the server like this:
de: Solltest du z.B. ihn mit [Python][1] installiert haben, dann kannst du die Umgebung so konfigurieren:
uk: Якщо ви використовуєте [Python Setup][1], ви можете встановити змінні середовища для сервера таким чином:

source: Operating System
de: Betriebssystem
uk: Операційна система

source: Squid is avaiable for all major platforms. For the commands and paths of this tutorial, we assume you run Squid on Debain/Ubuntu. The commands might work on other systems, but that is not tested.
de: Squid funktioniert auf allen gängigen Plattformen. Für die Kommandos und die Pfade in diesem Tutorial nehmen wir an, dass Squid auf einem Debian/Ubuntu läuft. Die Kommandos können auch auf anderen Systemen funktionieren. Das ist dann aber nicht gestestet.
uk: Squid доступний для всіх основних платформ. Для команд і шляхів у цьому посібнику ми припускаємо, що ви запускаєте Squid на Debain/Ubuntu. Команди можуть працювати в інших системах, але це не перевірено.

source: This is a comma separated list of encryption keys. These can be used to hide sensitive information of URLs.
de: Das ist eine Liste von Schlüsseln, die durch Komma getrennt sind. Diese Schlüssel werden genutzt, um vertrauliche Informationen zu verstecken.
uk: Це розділений комами список ключів шифрування. Їх можна використовувати, щоб приховати конфіденційну інформацію URL-адрес.

source: Disable encryption (default): `OWC_ENCRYPTION_KEYS=`
de: Keine Verschlüsselung anbieten (Voreinstellung): `OWC_ENCRYPTION_KEYS=`
uk: Вимкнути шифрування (за замовчуванням): `OWC_ENCRYPTION_KEYS=`

source: Use one key: `OWC_ENCRYPTION_KEYS='Pj...48='`
de: Einen Schlüssel benutzen: `OWC_ENCRYPTION_KEYS='Pj...48='`
uk: Використовуйте один ключ: `OWC_ENCRYPTION_KEYS='Pj...48='`

source: Use multiple keys: `OWC_ENCRYPTION_KEYS='Pj...48=,cx...Fw='` If you use multiple keys, only the first one encrypts the data. The others are only used to decrypt the data.
de: Mehrere Schlüssel benutzen: `OWC_ENCRYPTION_KEYS='Pj...48=,cx...Fw='` Wenn Du mehrere Schlüssel angibst, wird der erste zum Verschlüsseln genutzt. Die anderen entschlüsseln nur.
uk: Використовуйте кілька ключів: `OWC_ENCRYPTION_KEYS='Pj...48=,cx...Fw='` Якщо ви використовуєте кілька ключів, лише перший з них шифрує дані. Інші використовуються лише для розшифровки даних.

source: You can generate a new key by visiting your instance of the Open Web Calendar on the page [/new-key] or by running this command:
de: Du kannst einen neuen Schlüssel erzeugen, indem du deinen Offenen Web-Kalender auf der [/new-key]-Seite besuchst oder diesen Befehl ausführst:
uk: Ви можете створити новий ключ, відвідавши свій екземпляр Open Web Calendar на сторінці [/new-key] або виконавши цю команду:

source: [Fernet]
uk: [Фернет]

source: default `false`, values `true` or `false`, always `false` in the Docker container
de: Voreinstellung `false`, Werte `true` oder `false`, immer `false` im Dockercontainer
uk: за замовчуванням `false`, значення `true` або `false`, завжди `false` у контейнері Docker

source: The Open Web Calendar can be used to access the local network behind a firewall, see [Issue 250](https://github.com/niccokunzmann/open-web-calendar/issues/250). This free access is intended to show calendars from everywhere. Since `requests` is used by the Open Web Calendar, it can use a proxy as described in the [`requests` documentation](https://requests.readthedocs.io/en/latest/user/advanced/#proxies). The proxy can then handle the filtering.
uk: Відкритий веб-календар можна використовувати для доступу до локальної мережі за брандмауером, див. [Випуск 250](https://github.com/niccokunzmann/open-web-calendar/issues/250). Цей вільний доступ призначений для показу календарів звідусіль. Оскільки Відкритий веб-календар використовує `requests`, він може використовувати проксі-сервер, як описано у [документації `requests`](https://requests.readthedocs.io/en/latest/user/advanced/#proxies). Проксі може виконувати фільтрацію.

source: [API](../../dev/api)
de: [Entwickler-API](../../dev/api)

source: default `600`
es: por defecto `600`
ta: இயல்புநிலை `600`

source: default `true`, values `true` or `false`, always `false` in the Docker container
es: por defecto los valores `true`, `true` o `false`, siempre `false` en el contenedor Docker
ta: இயல்புநிலை `உண்மை`, மதிப்புகள்` உண்மை` அல்லது `பொய்`, எப்போதும் கப்பல்துறை கொள்கலனில்` தவறு`

source: The Open Web Calendar can be used to access the local network behind a firewall, see [Issue 250](https://github.com/niccokunzmann/open-web-calendar/issues/250). This free access is intended to show calendars from everywhere. Since `requests` is used by the Open Web Calender, it can use a proxy as described in the [`requests` documentation](https://requests.readthedocs.io/en/latest/user/advanced/#proxies). The proxy can then handle the filtering.
es: El Calendario web abierto puede utilizarse para acceder a la red local detrás de un cortafuegos, véase [Edición 250](https://github.com/niccokunzmann/open-web-calendar/issues/250). Este acceso libre está pensado para mostrar calendarios de todas partes. Dado que el Open Web Calender utiliza `peticiones`, puede utilizar un proxy como se describe en la [documentación de las`peticiones`](https://requests.readthedocs.io/en/latest/user/advanced/#proxies). El proxy puede entonces manejar el filtrado.
ta: ஃபயர்வாலுக்கு பின்னால் உள்ளக நெட்வொர்க்கை அணுக திறந்த வலை காலெண்டரைப் பயன்படுத்தலாம், [வெளியீடு 250](https://github.com/niccokunzmann/open-web-calendar/issues/250) ஐப் பார்க்கவும். இந்த இலவச அணுகல் எல்லா இடங்களிலிருந்தும் காலெண்டர்களைக் காண்பிக்கும் நோக்கம் கொண்டது. `கோரிக்கைகள்` திறந்த வலை காலெண்டரால் பயன்படுத்தப்படுவதால், [` கோரிக்கைகள்` ஆவணங்கள்](https://requests.readthedocs.io/en/latest/user/advanced/#proxies) இல் விவரிக்கப்பட்டுள்ளபடி இது ஒரு ப்ராக்சியைப் பயன்படுத்தலாம். பதிலாள் பின்னர் வடிகட்டலைக் கையாள முடியும்.

source: If you modify the default specification, you modify **all calendars** that are hosted at your instance. Calendars still override some values for their configuration. Those which they do not override are affected. Not all values are exposed to the configuration page to be changed. Those values can still be changed in the [default_specification.yml] and the query parameters.
es: Si modificas las especificaciones por defecto, modificarás **todos los calendarios** que estén alojados en tu instancia. Los calendarios siguen cancelando algunos valores de tu configuración. Aquellos que no los cancelen se verán afectados. No todos los valores están expuestos en la página de configuración para ser modificados. Esos valores aún pueden cambiarse en [default_specification.yml] y en los parámetros de la consulta.

source: The configuration of all calendars is rooted in the [default_specification.yml]. All those values can be changed through a copy of this file hosted on the web through the calendar parameter `specification_url`. Each parameter should be documented in [default_specification.yml].
es: La configuración de todos los calendarios está enraizada en [default_specification.yml]. Todos estos valores pueden ser cambiados a través de una copia de este archivo alojado en la web a través del parámetro calendario `specification_url`. Cada parámetro debe estar documentado en [default_specification.yml].

source: Examples:
es: Ejemplos:

source: There are loads more values that can be changed. Please refer to the [default_specification.yml]. These values are all documented.
es: Hay muchos más valores que se pueden cambiar. Consulta [default_specification.yml]. Todos estos valores están documentados.

source: This functionality is provided by [flask-allowed-hosts](https://pypi.org/project/flask-allowed-hosts/).
es: Esta función es proporcionada por [flask-allowed-hosts](https://pypi.org/project/flask-allowed-hosts/).
