Repository: niccokunzmann/open-web-calendar
Catalog: open_web_calendar/translations/*/LC_MESSAGES/host/configure.md.po
Languages: de, es, ta, uk

source: Configure a hosted instance.
de: Passe einen eigenen Server an.
es: Personaliza tu propio servidor.
ta: புரவலன் செய்யப்பட்ட நிகழ்வை உள்ளமைக்கவும்.
uk: Налаштуйте розміщений екземпляр.

source: If you want to change the Open Web Calendar to serve your needs, this is well possible. You can choose to
de: Wenn Du den Offenen Web-Kalender auf das anpassen willst, das du brauchst, dann ist das gut möglich. Du kannst
es: Si deseas cambiar el Calendario Web Abierto para satisfacer tus necesidades, se puede hacer. Puedes elegir
ta: உங்கள் தேவைகளைப் நிறைவு செய்ய திறந்த வலை காலெண்டரை மாற்ற விரும்பினால், இது நல்லது. நீங்கள் தேர்வு செய்யலாம்
uk: Якщо ви хочете змінити відкритий веб-календар відповідно до своїх потреб, це цілком можливо. Ви можете вибрати

source: Change how the default calendar looks.
de: Ändern, wie der Standard-Kalender aussieht.
es: Cambiar la apariencia del calendario predeterminado.
ta: இயல்புநிலை காலண்டர் எப்படி இருக்கும் என்பதை மாற்றவும்.
uk: Змінити вигляд календаря за замовчуванням.

source: Change how the server works.
de: Ändern, wie der Server funtioniert.
es: Cambiar el funcionamiento del servidor.
ta: சேவையகம் எவ்வாறு செயல்படுகிறது என்பதை மாற்றவும்.
uk: Змінити роботу сервера.

source: Server Configuration
de: Servereinstellungen
es: Configuración del servidor
ta: சேவையக உள்ளமைவு
uk: Конфігурація сервера

source: Configuring the Default Calendar
de: Den Standard-Kalender anpassen
es: Configurar el calendario predeterminado
ta: இயல்புநிலை காலெண்டரை கட்டமைத்தல்
uk: Налаштування календаря за замовчуванням

source: Configuring the Server
de: Den Server Anpassen
es: Configurando el servidor
ta: சேவையகத்தை உள்ளமைத்தல்
uk: Налаштування Сервера

source: Environment variables only influence the running of the server. These environment variables can be used to configure the service:
de: Umgebungsvariablen beeinflussen nur das Verhalten des Servers. Diese Umgebungsvariablen können für den Server verwendet werden:
es: Las variables de entorno solo influyen en el funcionamiento del servidor. Estas variables del entorno se pueden utilizar para configurar el servicio:
ta: சுற்றுச்சூழல் மாறிகள் சேவையகத்தின் இயக்கத்தை மட்டுமே பாதிக்கின்றன. சேவையை உள்ளமைக்க இந்த சுற்றுச்சூழல் மாறிகள் பயன்படுத்தப்படலாம்:
uk: Змінні середовища впливають лише на роботу сервера. Ці змінні середовища можна використовувати для налаштування служби:

source: default empty
de: Standardwert: leer
es: vacío predeterminado
ta: இயல்புநிலை காலியாக உள்ளது
uk: за замовчуванням порожній

source: default `5000`, default `80` in the Docker container
de: Standardwert: `5000`, im Docker-Container: `80`
es: por defecto` 5000` , predeterminado` 80` en el contenedor Docker
ta: இயல்புநிலை `5000`, இயல்புநிலை` 80` கப்பல்துறை கொள்கலனில்
uk: за замовчуванням `5000`, за замовчуванням `80` в контейнері Docker

source: The port that the service is running on.
de: Der Netzwerk-Port auf dem der Dienst läuft.
es: El puerto en el que se ejecuta el servicio.
ta: பணி இயங்கும் துறைமுகம்.
uk: Порт, на якому працює служба.

source: Serve on HTTP port: `PORT=80`
de: Den HTTP-Port nutzen: `PORT=80`
es: Servir en el puerto HTTP:` PUERTO=80`
ta: HTTP போர்ட்டில் பரிமாறவும்: `போர்ட் = 80`
uk: Обслуговувати через порт HTTP: `PORT=80`

source: default `4`, only for the Docker container
de: Standardwert: `4`, nur im Docker-Container
es: por defecto ` 4 ` , solo para el contenedor Docker
ta: இயல்புநிலை `4`, கப்பல்துறை கொள்கலனுக்கு மட்டுமே
uk: за замовчуванням `4`, лише для контейнера Docker

source: The number of parallel workers to handle requests.
de: Die Anzahl paralleler Arbeiter, um die Anfragen zu beantworten.
es: El número de trabajadores paralelos para gestionar las peticiones.
ta: கோரிக்கைகளை கையாள இணையான தொழிலாளர்களின் எண்ணிக்கை.
uk: Кількість паралельних працівників для обробки запитів.

source: Only use one worker: `WORKERS=1`
de: Nutze nur einen Arbeiter: `WORKERS=1`
es: Utilice sólo un trabajador: `WORKERS=1`
ta: ஒரு தொழிலாளியைப் பயன்படுத்துங்கள்: `தொழிலாளர்கள் = 1`
uk: Використовуйте лише один робочий файл: `WORKERS=1`

source: Seconds to cache the calendar files that get downloaded to reduce bandwidth and delay.
de: Sekunden, die die Kalenderdateien zwischengespeichert werden, um Bandbreite und Verzögerung zu reduzieren.
es: Segundos para almacenar en la caché los archivos del calendario que se descargan para reducir el ancho de banda y las demoras.
ta: அலைவரிசை மற்றும் தாமதத்தைக் குறைப்பதற்காக பதிவிறக்கம் செய்யப்படும் காலண்டர் கோப்புகளை கேச் செய்ய விநாடிகள்.
uk: Секунди для кешування файлів календаря, які завантажуються, щоб зменшити пропускну здатність і затримку.

source: Refresh fast: `CACHE_REQUESTED_URLS_FOR_SECONDS=10`
de: Schnelles Neuladen: `CACHE_REQUESTED_URLS_FOR_SECONDS=10`
es: Actualización rápida: `CACHE_REQUESTED_URLS_FOR_SECONDS=10`
ta: வேகமாக புதுப்பிக்கவும்: `cache_requested_urls_for_seconds = 10`
uk: Швидке оновлення: `CACHE_REQUESTED_URLS_FOR_SECONDS=10`

source: Set the debug flag for the app.
de: Setze das Debug-Flag für die App.
es: Establecer el indicador de depuración para la aplicación.
ta: பயன்பாட்டிற்கான பிழைத்திருத்த கொடியை அமைக்கவும்.
uk: Установіть прапор налагодження для програми.

source: The Open Web Calendar uses libraries whose behavior can be further customized.
de: Der offene Web-Kalender nutzt Bibliotheken, mit denen das Verhalten weiter angepasst werden kann.
es: Calendario web abierto utiliza bibliotecas cuyo comportamiento se puede personalizar aún más.
ta: திறந்த வலை காலண்டர் நூலகங்களைப் பயன்படுத்துகிறது, அதன் நடத்தை மேலும் தனிப்பயனாக்க முடியும்.
uk: Відкритий веб-календар використовує бібліотеки, поведінку яких можна додатково налаштувати.

source: **Flask** has **[more environment variables](https://flask.palletsprojects.com/en/3.0.x/config/)** available to configure how the application serves content.
de: **Flask** hat **[mehr Umgebungsvariablen](https://flask.palletsprojects.com/en/3.0.x/config/)**, die verändern, wie der Server Inhalte liefert.
es: **Flask** tiene **[más variables de entorno](https://flask.palletsprojects.com/en/3.0.x/config/)** disponibles para configurar cómo la aplicación entrega el contenido.
ta: **Flask** has **[more சூழல் variables](https://flask.palletsprojects.com/en/3.0.x/config/)** available பெறுநர் configure how the application serves content.
uk: **Flask** має **[більше змінних середовища](https://flask.palletsprojects.com/en/3.0.x/config/)**, щоб налаштувати, як програма обслуговує вміст.

source: SSRF Protection with a Proxy Server
de: SSRF-Schutz druch einen Proxy
es: Protección SSRF a través de un proxy
ta: பதிலாள் சேவையகத்துடன் எச்.எச்.ஆர்.எஃப் பாதுகாப்பு
uk: Захист SSRF за допомогою проксі-сервера

source: [Prevent SSRF using a Tor proxy](../docker#preventing-ssrf-attacks-using-a-tor-proxy)
de: [SSRF-Atacken durch einen Proxy abwehren](../docker#preventing-ssrf-attacks-using-a-tor-proxy)
es: [Prevenir SSRF usando un proxy Tor](../docker#preventing-ssrf-attacks-using-a-tor-proxy)
uk: [Запобігання SSRF за допомогою проксі-сервера Tor](../docker#preventing-ssrf-attacks-using-a-tor-proxy)

source: **Requests** is used the get the `.ics` files. You can [configure a proxy](#ssrf-protection-with-a-proxy-server).
de: **requests** wird genutzt, um die `.ics`-Dateien herunterzuladen. Du kannst einen [Proxy bestimmen](#ssrf-protection-with-a-proxy-server).
es: ** Peticiones** se utiliza para obtener el ` .ics` archivos. Puede [configurar un proxy](#ssrf-protection-with-a-proxy-server).
uk: **Запити** використовуються для отримання файлів `.ics`. Ви можете [налаштувати проксі](#ssrf-protection-with-a-proxy-server).

source: You might want to change the following values.
de: Wahrscheinlich willst Du die folgenden Werte ändern.
es: Es posible que quieras cambiar los siguientes valores.
ta: பின்வரும் மதிப்புகளை மாற்ற நீங்கள் விரும்பலாம்.
uk: Ви можете змінити наступні значення.

source: The title of your website.
de: Der Titel der Webseite.
es: El título de tu página web.
ta: உங்கள் வலைத்தளத்தின் தலைப்பு.
uk: Назва вашого сайту.

source: This is the default language. You might want to change this to serve the configuration page better to a local audience.
de: Das ist die Standart-Sprache. Wenn Du die änderst, haben es Leute einfacher, die lokal mit dir arbeiten.
es: Este es el idioma predeterminado. Es posible que desees cambiarlo para ofrecer una mejor configuración a una audiencia local.
ta: இது இயல்புநிலை மொழி. உள்ளமைவு பக்கத்தை உள்ளக பார்வையாளர்களுக்கு சிறப்பாக வழங்க இதை மாற்ற நீங்கள் விரும்பலாம்.
uk: Це мова за умовчанням. Ви можете змінити це, щоб сторінка конфігурації була кращою для місцевої аудиторії.

source: This is a link to the website icon.
de: Das ist der Link zu dem Bild der Webseite.
es: Este es el favicon de la página web.
ta: இது வலைத்தள ஐகானுக்கான இணைப்பு.
uk: Це посилання на значок веб-сайту.

source: If you made changes, you are legally required to disclose them to visitors. Please adjust the link or contribute them back to the main project.
de: Wenn DU Änderungen vorgenommen hast, bist du legal verpflichtet, diese den Besuchern der Webseite mitzuteilen. Bitte verändere den Link oder füge sie zum Hauptprojekt hinzu.
es: Si ha realizado cambios, está legalmente obligado a revelarlos a los visitantes. Le rogamos que adapte el enlace o los aporte de nuevo al proyecto principal.
ta: நீங்கள் மாற்றங்களைச் செய்தால், பார்வையாளர்களுக்கு அவர்களை வெளியிடுவதற்கு நீங்கள் சட்டப்பூர்வமாக தேவை. தயவுசெய்து இணைப்பை சரிசெய்யவும் அல்லது அவற்றை முதன்மையான திட்டத்திற்கு மீண்டும் பங்களிக்கவும்.
uk: Якщо ви внесли зміни, ви зобов’язані повідомити про них відвідувачам за законом. Відкоригуйте посилання або поверніть їх до основного проекту.

source: If you want to redirect to contribute to your project.
de: Wenn Du auf eine andere Seite verweisen magst, um zu Deinem Projekt beizutragen.
es: Si quieres redirigir a otro lugar, para que ayuden en tu proyecto.
ta: உங்கள் திட்டத்திற்கு பங்களிக்க நீங்கள் திருப்பி விட விரும்பினால்.
uk: Якщо ви хочете перенаправити свій внесок у свій проект.

source: If you host this service yourself, you can use the default [privacy policy][privacy-policy].
de: Wenn Du diesen Dienst auf einem eigenen Server betreibst, dann kannst Du unsere [Datenschutzerklärung][privacy-policy] verwenden.
es: Si alojas este servicio tu mismo, puedes utilizar la [política de privacidad][privacy-policy] predeterminada.
ta: இந்த சேவையை நீங்களே புரவலன் செய்தால், இயல்புநிலை [தனியுரிமைக் கொள்கை][privacy-policy] ஐப் பயன்படுத்தலாம்.
uk: Якщо ви самостійно розміщуєте цю службу, ви можете використовувати стандартну [політику конфіденційності][privacy-policy].

source: If for some reason you decide to collect data i.e. in the HTTPS proxy or log IP-addresses, then you need to create your own privacy policy. You can link to the one of this project.
de: Solltest Du DIch aus irgendeinem Grund entscheiden, personenbezogene Daten zu speichern, z.B. im HTTPS-Proxy die IP-Adressen, dann musst Du eine eigene Datenschutzerklärung erstellen. Du kannst darin die des Projektes verlinken.
es: Si por alguna razón decides recoger datos, por ejemplo, en el proxy HTTPS o registrar direcciones IP, entonces necesitas crear tu propia política de privacidad. Puedes enlazar con la de este proyecto.
ta: சில காரணங்களால் நீங்கள் தரவைச் சேகரிக்க முடிவு செய்தால், அதாவது HTTPS பதிலாள் அல்லது பதிவு ஐபி முகவரிகளில், நீங்கள் உங்கள் சொந்த தனியுரிமைக் கொள்கையை உருவாக்க வேண்டும். இந்த திட்டத்தில் ஒன்றை நீங்கள் இணைக்கலாம்.
uk: Якщо з якоїсь причини ви вирішите збирати дані, наприклад, у HTTPS-проксі або реєструвати IP-адреси, вам потрібно створити власну політику конфіденційності. Ви можете посилатися на один із цього проекту.

source: More Values
de: Mehr Werte
es: Más valores
ta: மேலும் மதிப்புகள்
uk: Більше цінностей

source: The clients divided by comma that are allowed to access the Open Web Calendar. You will see this text if you try to access the service and you are not allowed:
de: Die Klienten durch Komma getrennt, die den Open Web Calendar benutzen dürfen. Du wirst diesen Text sehen, wenn du den Dienst benutzen willst aber nicht darfst:
es: Los clientes separados por comas que tienen permiso para acceder al Open Web Calendar. Verá este texto si intenta acceder al servicio y no tiene permisos:
ta: திறந்த வலை காலெண்டரை அணுக அனுமதிக்கப்பட்ட கமாவால் வாடிக்கையாளர்கள் வகுக்கப்படுகிறார்கள். நீங்கள் சேவையை அணுக முயற்சித்தால் இந்த உரையைப் பார்ப்பீர்கள், உங்களுக்கு இசைவு இல்லை:
uk: Клієнти, розділені комами, яким дозволено доступ до відкритого веб-календаря. Ви побачите цей текст, якщо спробуєте отримати доступ до служби, але вам заборонено:

source: permit only the same computer: `ALLOWED_HOSTS=localhost`
de: Nur den eigenen Computer zulassen: `ALLOWED_HOSTS=localhost`
es: permitir solo al mismo ordenador: `ALLOWED_HOSTS=localhost`
ta: ஒரே கணினியை மட்டுமே அனுமதிக்கவும்: `அனுமதிக்கப்பட்ட_ஓச்ட்ச் = உள்ளக ஓச்ட்`
uk: дозволяти лише той самий комп’ютер: `ALLOWED_HOSTS=localhost`

source: permit several hosts: `ALLOWED_HOSTS=192.168.0.1,192.168.2,api.myserver.com`
de: Mehrere Computer zulassen: `ALLOWED_HOSTS=192.168.0.1,192.168.2,api.myserver.com`
es: permitir varios hosts: `ALLOWED_HOSTS=192.168.0.1,192.168.2,api.myserver.com`
ta: பல ஓச்ட்களை அனுமதிக்கவும்: `அனுமதிக்கப்பட்ட_ஓச்ட்ச் = 192.168.0.1,192.168.2, api.myserver.com`
uk: дозволити декілька хостів: `ALLOWED_HOSTS=192.168.0.1,192.168.2,api.myserver.com`

source: permit everyone to access the server (default): `ALLOWED_HOSTS=` or `ALLOWED_HOSTS=*`
de: Allen erlauben, den Server zu benutzen (Voreinstellung): `ALLOWED_HOSTS=` oder `ALLOWED_HOSTS=*`
es: permitir a todo el mundo el acceso al servidor (por defecto): `ALLOWED_HOSTS=` o `ALLOWED_HOSTS=*`
ta: சேவையகத்தை அணுக அனைவரையும் அனுமதிக்கவும் (இயல்புநிலை): `அனுமதிக்கப்பட்ட_ஓச்ட்ச் =` அல்லது `அனுமதிக்கப்பட்ட_ஓச்ட்ச் =*`
uk: дозволити всім доступ до сервера (за замовчуванням): `ALLOWED_HOSTS=` або `ALLOWED_HOSTS=*`

source: The configuration of all calendars is rooted in the [default_specification]. All those values can be changed through a copy of this file hosted on the web through the calendar parameter `specification_url`. Each parameter should be documented in [default_specification].
de: Die Grundeinstellungen aller Kalender befinden sich in der [default_specification]. All diese Einstellungen können durch eine Kopie der Datei verändert werden, die irgendwo im Web zu finden ist. Ihre URL muss dann als `specification_url` Parameter angegeben werden. Jeder Parameter sollte in der [default_specification] dokumentiert sein.
ta: அனைத்து காலெண்டர்களின் உள்ளமைவும் [இயல்புநிலை_ விவரக்குறிப்பு] இல் வேரூன்றியுள்ளது. அந்த மதிப்புகள் அனைத்தையும் வலையில் வழங்கப்பட்ட இந்த கோப்பின் நகல் மூலம் காலண்டர் அளவுரு `விவரக்குறிப்பு_ஆர்ல்` மூலம் மாற்றலாம். ஒவ்வொரு அளவுருவும் [இயல்புநிலை_ விவரக்குறிப்பு] இல் ஆவணப்படுத்தப்பட வேண்டும்.
uk: Конфігурація всіх календарів базується на [default_specification]. Усі ці значення можна змінити за допомогою копії цього файлу, розміщеного в Інтернеті за допомогою параметра календаря `specification_url`. Кожен параметр має бути задокументований у [default_specification].

source: To modify **all calendars** hosted on your instance, use the [OWC_SPECIFICATION] environment variable. Calendars still override some values for their configuration. Those which they do not override are affected by the default specification. Not all values are exposed to the configuration page to be changed. Those values can still be changed in the `specification_url` and the query parameters.
de: Um **alle Kalender** einer Instanz zu verändern, benutze die Umgebungsvariable [OWC_SPECIFICATION]. Kalender überschreiben dann immer noch ihre Einstellungen. Die Einstellungen, die die Kalender nicht selbst vornehmen, werden durch diese Voreinstellungen bestimmt. Nicht alle Werte werden auf der Konfigurationsseite angeboten. Trotzdem können sie durch die `specification_url` und die URL-Parameter verändert werden.
ta: உங்கள் நிகழ்வில் புரவலன் செய்யப்பட்ட ** அனைத்து காலெண்டர்களும் ** மாற்ற, [OWC_SPECIFICATION] சுற்றுச்சூழல் மாறியைப் பயன்படுத்தவும். காலெண்டர்கள் அவற்றின் உள்ளமைவுக்காக சில மதிப்புகளை மேலெழுதும். அவை மேலெழுதாதவை இயல்புநிலை விவரக்குறிப்பால் பாதிக்கப்படுகின்றன. மாற்றப்பட வேண்டிய உள்ளமைவு பக்கத்திற்கு எல்லா மதிப்புகளும் வெளிப்படுவதில்லை. அந்த மதிப்புகள் இன்னும் `விவரக்குறிப்பு_ஆர்ல்` மற்றும் வினவல் அளவுருக்களில் மாற்றப்படலாம்.
uk: Щоб змінити **усі календарі**, розміщені у вашому екземплярі, використовуйте змінну середовища [OWC_SPECIFICATION]. Календарі все ще замінюють деякі значення для їх конфігурації. На ті, які вони не перевизначають, впливає специфікація за замовчуванням. Не всі значення відображаються на сторінці конфігурації, яку потрібно змінити. Ці значення можна змінити в `specification_url` і параметрах запиту.

source: There are loads more values that can be changed. Please refer to the [default_specification]. These values are all documented. Please use the [OWC_SPECIFICATION] environment variable to change them.
de: Es gibt viel mehr Werte, die verändert werden können. Siehe [default_specification]. Diese Werte sind alle dokumentiert. Benutze die Umgebungsvariable [OWC_SPECIFICATION], um sie zu ändern.
ta: மாற்றக்கூடிய பல மதிப்புகள் உள்ளன. தயவுசெய்து [இயல்புநிலை_ விவரக்குறிப்பு] ஐப் பார்க்கவும். இந்த மதிப்புகள் அனைத்தும் ஆவணப்படுத்தப்பட்டுள்ளன. அவற்றை மாற்ற [OWC_SPECIFICATION] சுற்றுச்சூழல் மாறியைப் பயன்படுத்தவும்.
uk: Є ще багато значень, які можна змінити. Будь ласка, зверніться до [default_specification]. Усі ці значення задокументовані. Щоб змінити їх, використовуйте змінну середовища [OWC_SPECIFICATION].

source: `OWC_SPECIFICATION` is an optional environment variable.
de: `OWC_SPECIFICATION` ist eine optionale Umgebungsvariable.
ta: `OWC_SPECIFICATION` என்பது ஒரு விருப்ப சூழல் மாறி.
uk: `OWC_SPECIFICATION` – необов’язкова змінна середовища.

source: It can be a **path** to a file containing valid YAML or JSON.
de: Das kann ein **Pfad** zu einer Datei mit YAML- oder JSON-Inhalt sein.
ta: இது செல்லுபடியாகும் YAML அல்லது சாதொபொகு கொண்ட கோப்புக்கு ** பாதை ** ஆக இருக்கலாம்.
uk: Це може бути **шлях** до файлу, що містить дійсний YAML або JSON.

source: It can be a **string** containing valid YAML or JSON.
de: Das kann eine YAML oder JSON **Zeichenkette** sein.
ta: இது செல்லுபடியாகும் YAML அல்லது சாதொபொகு ஐக் கொண்ட ** சரம் ** ஆக இருக்கலாம்.
uk: Це може бути **рядок**, що містить дійсний YAML або JSON.

source: Setting `OWC_SPECIFICATION` allows you to replace default values for all calendars.
de: Durch Setzen der `OWC_SPECIFICATION`-Variable werden die Voreinstellungen aller Kalender geändert.
ta: `OWC_SPECIFICATION` அமைப்பது அனைத்து காலெண்டர்களுக்கும் இயல்புநிலை மதிப்புகளை மாற்ற உங்களை அனுமதிக்கிறது.
uk: Налаштування `OWC_SPECIFICATION` дозволяє замінити значення за замовчуванням для всіх календарів.

source: In following example, the title for all calendars that do not set their own title will be changed.
de: Im folgenden Beispiel werden die Titel aller Kalender gesetzt, die nicht ihren eigenen Titel setzen.
ta: பின்வரும் எடுத்துக்காட்டில், தங்கள் சொந்த தலைப்பை அமைக்காத அனைத்து காலெண்டர்களுக்கும் தலைப்பு மாற்றப்படும்.
uk: У наступному прикладі буде змінено заголовок для всіх календарів, які не встановили власний заголовок.

source: Note
de: Anmerkung
ta: குறிப்பு
uk: Примітка

source: New versions of the Open Web Calendar can add new configuration parameters. Placing your changes in this variable instead of changing the `default_specification` file will ensure that you do not break the Open Web Calendar in a future version.
de: Neue Versionen des Offenen Web-Kalenders können neue Einstellungen hinzufügen. Wenn Deine Voreinstellungen in dieser Variable sind, dann ist sicher gestellt, dass neue Versionen sofort funktionieren. Verändere besser nicht die `default_specification`.
ta: திறந்த வலை காலெண்டரின் புதிய பதிப்புகள் புதிய உள்ளமைவு அளவுருக்களைச் சேர்க்கலாம். `Default_specification` கோப்பை மாற்றுவதற்குப் பதிலாக இந்த மாறியில் உங்கள் மாற்றங்களை வைப்பது எதிர்கால பதிப்பில் திறந்த வலை காலெண்டரை உடைக்கவில்லை என்பதை உறுதி செய்யும்.
uk: Нові версії Open Web Calendar можуть додавати нові параметри конфігурації. Внесення змін до цієї змінної замість зміни файлу `default_specification` гарантує, що ви не порушите відкритий веб-календар у майбутній версії.

source: This functionality is provided by [flask-allowed-hosts].
de: Diese Funktionalität wird durch [flask-allowed-hosts] bereitgestellt.
uk: Цю функцію надає [flask-allowed-hosts].

source: The Open Web Calendar relies on proxy servers for these features:
de: Der Offene Web-Kalender braucht einen Proxy, um Folgendes zu erreichen:
uk: Відкритий веб-календар покладається на проксі-сервери для таких функцій:

source: **Access Control and Users** To restrict who can use the Open Web Calendar, you can use `nginx` or `apache` as a reverse proxy in front of it. YuNoHost is another self-hosting option to restrict access.
de: **Zugriffsbeschränkung und Nutzerrechte** Um zu bestimmen, wer den Offenen Web-Kalender benutzen kann, kannst du `nginx` oder `apache` als Reverse-Proxy davorschalten. YuNoHost ist eine andere Option, wie man Zugriff verwalten kann.
uk: **Контроль доступу та користувачі** Щоб обмежити, хто може використовувати відкритий веб-календар, ви можете використовувати `nginx` або `apache` як зворотний проксі перед ним. YuNoHost — ще один варіант самостійного розміщення для обмеження доступу.

source: **HTTPS Encryption** This can be done by `nginx`, `apache` or `caddy`.
de: **HTTPS Verschlüsselung** Das kannst Du mit `nginx`, `apache` oder `caddy` erreichen.
uk: **Шифрування HTTPS** Це можна зробити за допомогою `nginx`, `apache` або `caddy`.

source: **More Advanced Caching** Basic caching is handeled by the Open Web Calendar. For more advanced cache configuration, use a proxy server like `squid`. Have a look in the documentation below on how to make the Open Web Calendar access the web only through a proxy.
de: **Besseres Caching** Rudimentäres Caching ist im Offenen Web-Kalender eingebaut. Um genauere Einstellungen zu treffen, benutze einen Proxy wie `squid`. Sie die Dokumentation darunter an, um so einen Proxy zu benutzen.
uk: **Більш розширене кешування** Базове кешування обробляється Open Web Calendar. Для більш розширеної конфігурації кешу використовуйте проксі-сервер, наприклад `squid`. Перегляньте наведену нижче документацію про те, як зробити відкритий веб-календар доступом до Інтернету лише через проксі.

source: **Restricting Access to Calendars** By default, the Open Web Calendar does not restrict which calendars to show. Use the proxy server to filter the calendars. If you run the Open Web Calendar behind a firewall with other web services, setting up a proxy is necessary to protect from SSRF attacks.
de: **Zugriff auf Kalender** Standardmäßig wird der Offene Web-Kalender nicht einschränken, welche Kalender angezeigt werden. Benutze einen Proxy, um die Kalender zu filtern. Wenn der Offene Web-Kalender hinter einer Firewall neben anderen Diensten läuft, ist es geraten, einen Proxy zu verwenden, um SSRF-Atacken vorzubeugen.
uk: **Обмеження доступу до календарів** За замовчуванням відкритий веб-календар не обмежує, які календарі показувати. Використовуйте проксі-сервер для фільтрації календарів. Якщо ви запускаєте Open Web Calendar за брандмауером разом з іншими веб-службами, для захисту від атак SSRF необхідно налаштувати проксі-сервер.

source: Squid as a Proxy Server
de: Squid als Proxy-Server
uk: Squid як проксі-сервер
