Repository: niccokunzmann/open-web-calendar
Catalog: open_web_calendar/translations/*/LC_MESSAGES/host/self.md.po
Languages: cs, de, eo, es

source: There are various ways to host the Open Web Calendar yourself and customize the deployment.
cs: Jsou různé způsoby jak hostovat Open Web Calendar a přizpůsobit jeho nasazení.
de: Es gibt mehrere Wege, den offenen Web-Kalender aufzusetzen und damit anzupassen.
eo: Ekzistas diversaj manieroj memgastigi la Malfermitan Retan Kalendaron kaj adapti la disponigon.
es: Hay varias formas de configurar y personalizar el calendario web abierto.

source: Self-Hosting & Deployment
cs: Vlastní hosting &amp; nasazení
de: Eigener Server
eo: Memaj gastigado kaj disponado
es: Autohospedaje e implementación

source: You do not have to host the Open Web Calendar yourself but you are encouraged to. It is intended to work behind a company firewall, through a proxy and also without access to the Internet.
cs: Není nutné mít vlastní hosting pro Open Web Calendar, nicméně je to doporučeno. Zamýšlené použití je s firemním firewallem, skrze proxy a také bez přístupu k internetu.
de: Du musst den offenen Web-Kalender nicht selbst aufsetzen, kannst es aber gern tun. Der Kalender soll hinter einer Firmen-Firewall funktionieren, durch einen Proxy und auch ohne Internetzugriff.
eo: Vi ne devas memgastigi la Malfermitan Retan Kalendaron, sed ni rekomendas tion. Tio funkcias malgraŭ firmaa fajroŝirmilo, tra retperilo, kaj ankaŭ sen konekto al Interreto.
es: No es necesario que tu mismo alojes el Calendario web abierto, pero le animamos a que lo haga. Está pensado para funcionar detrás del cortafuegos de una empresa, a través de un proxy y también sin acceso a Internet.

source: Several hosting options are already documented. We are grateful if you can add your favorite one, too.
cs: Různé možnosti hostingu již jsou zdokumentovány. Budeme vděční pokud přidáte i Vaši oblíbenou možnost.
de: Mehrere Hosting-Optionen sind schon dokumentiert. Wir sind dankbar, wenn Du deine Lieblingsoption hier dokumentierst.
eo: Pluraj gastigaj opcioj jam estas dokumentitaj. Se vi konas alian, bonvolu aldoni ĝin.
es: Ya están documentadas varias opciones de alojamiento. Te agradeceremos que añadas también tu opción favorita.

source: You can create a fork of this repository which automatically deploys to [Vercel](https://vercel.com/):
cs: Můžete vytvořit fork tohoto repozitáře, který se automaticky nasazuje na [Vercel](https://vercel.com/):
de: Du kannst einen Klon erstellen, der automatisch auf [Vercel](https://vercel.com/) aufgesetzt wird:
eo: Vi povas krei forkon de tiu deponejo, kiu aŭtomate disponas al [Vercel](https://vercel.com/):
es: Puede crear una bifurcación de este repositorio que se implementa automáticamente en [Vercel](https://vercel.com/):

source: Alternatively you can create a one off deploy by cloning this repository and running `npx vercel` at the root.
cs: Naklonováním tohoto repozitáře a spuštěním `npx vercel` v kořenovém adresáři můžete také vytvořit nový mimo nasazení.
de: Alternativ kannst du den Server einmalig aufsetzen, indem Du einen lokalen Klon erstellst und darin `npx vercel` ausführst.
eo: Alternative vi povas disponigi unufoje klonante tiun deponejon kaj rulante `npx vercel` ĉe la radiko.
es: Alternativamente, puede crear una implementación única clonando este repositorio y ejecutando `npx vercel` en la raíz.

source: You can deploy the app using [Heroku](https://heroku.com).
cs: Aplikaci můžete nasadit pomocí [Heroku](https://heroku.com).
de: Du kannst den Server mit [Heroku](https://heroku.com) aufsetzen.
eo: Vi povas disponigi la programon per [Heroku](https://heroku.com).
es: Puedes implementar la aplicación utilizando [Heroku](https://heroku.com).

source: Heroku uses [gunicorn](https://gunicorn.org/) to run the server, see the [Procfile](https://github.com/niccokunzmann/open-web-calendar/blob/master/Procfile).
cs: Heroku používá [gunicorn](https://gunicorn.org/) pro běh serveru, viz [Procfile](https://github.com/niccokunzmann/open-web-calendar/blob/master/Procfile).
de: Heroku benutzt[gunicorn](https://gunicorn.org/), um den Server auszuführen, siehe [Procfile](https://github.com/niccokunzmann/open-web-calendar/blob/master/Procfile).
eo: Heroku uzas [gunicorn](https://gunicorn.org/) por la servilo. Vidu la [Procfile](https://github.com/niccokunzmann/open-web-calendar/blob/master/Procfile).
es: Heroku utiliza [gunicorn](https://gunicorn.org/) para ejecutar el servidor, consulta el [Procfile](https://github.com/niccokunzmann/open-web-calendar/blob/master/Procfile).

source: The Open Web Calendar has been integrated into [Cloudron](https://www.cloudron.io/).
cs: Open Web Calendar byl integrován do [Cloudron](https://www.cloudron.io/).
de: Der offene Web-Kalender ist auf [Cloudron](https://www.cloudron.io/) verfügbar.
eo: La Malfermita Reta Kalendaro estas integrita al [Cloudron](https://www.cloudron.io/).
es: El calendario web abierto se ha integrado en [Cloudron](https://www.cloudron.io/).

source: [Cloudron Documentation](https://docs.cloudron.io/apps/openwebcalendar/)
cs: [Cloudron Dokumentace](https://docs.cloudron.io/apps/openwebcalendar/)
de: [Cloudrons Dokumentation](https://docs.cloudron.io/apps/openwebcalendar/)
eo: [Dokumentaro pri Cloudron](https://docs.cloudron.io/apps/openwebcalendar/)
es: [Documentación de Cloudron](https://docs.cloudron.io/apps/openwebcalendar/)

source: [Cloudron Repository](https://git.cloudron.io/cloudron/openwebcalendar-app)
cs: [Cloudron Repozitář](https://git.cloudron.io/cloudron/openwebcalendar-app)
de: [Cloudrons Repository](https://git.cloudron.io/cloudron/openwebcalendar-app)
eo: [Deponejo por Cloudron](https://git.cloudron.io/cloudron/openwebcalendar-app)
es: [Repositorio Cloudron](https://git.cloudron.io/cloudron/openwebcalendar-app)

source: The Open Web Calendar is available as an app for [YunoHost](https://yunohost.org/).
cs: Open Web Calendar je k dispozici jako aplikace pro [YunoHost](https://yunohost.org/).
de: Der offene Web-Kalender ist als App für [YunoHost](https://yunohost.org/) erhältlich.
eo: La Malfermita Reta Kalendaro estas disponebla kiel programo por [YunoHost](https://yunohost.org/).
es: El Calendario Web Abierto está disponible como aplicación para [YunoHost](https://yunohost.org/).

source: [App Description](https://apps.yunohost.org/app/open-web-calendar)
cs: [Popis aplikace](https://apps.yunohost.org/app/open-web-calendar)
de: [Appbeschreibung](https://apps.yunohost.org/app/open-web-calendar)
eo: [Priskribo de programo](https://apps.yunohost.org/app/open-web-calendar)
es: [Descripción de la aplicación](https://apps.yunohost.org/app/open-web-calendar)

source: [Repository](https://github.com/YunoHost-Apps/open-web-calendar_ynh/blob/master/ALL_README.md)
cs: [Repozitář](https://github.com/YunoHost-Apps/open-web-calendar_ynh/blob/master/ALL_README.md)
de: [Verzeichnis](https://github.com/YunoHost-Apps/open-web-calendar_ynh/blob/master/ALL_README.md)
eo: [Deponejo](https://github.com/YunoHost-Apps/open-web-calendar_ynh/blob/master/ALL_README.md)
es: [Repositorio](https://github.com/YunoHost-Apps/open-web-calendar_ynh/blob/master/ALL_README.md)

source: Update Notifications
cs: Oznámení aktualizací
de: Nachrichten über Updates
eo: Sciigoj pri ĝisdatigoj
es: Noticias sobre actualizaciones

source: If you wish to receive notifications about new updates of the software, watch the [GitHub repository](https://github.com/niccokunzmann/open-web-calendar/).
cs: Pokud chcete dostávat oznámení o nových aktualizacích softwaru, sledujte [GitHub repozitář](https://github.com/niccokunzmann/open-web-calendar/).
de: Wenn Du über neue Versionen benachrichtigt werden möchtest, dann überwache das [GitHub-Repository](https://github.com/niccokunzmann/open-web-calendar/).
eo: Se vi deziras ricevi sciigojn pri novaj ĝisdatigoj de la programo, abonu la [GitHub-deponejon](https://github.com/niccokunzmann/open-web-calendar/).
es: Si deseas recibir notificaciones sobre nuevas actualizaciones del software, consulta el [repositorio de GitHub](https://github.com/niccokunzmann/open-web-calendar/).

source: If you run your own server, you can choose to run the Open Web Calender with Docker. Building, running and updating are [documented here](../docker).
cs: Pokud spustíte svůj vlastní server, můžete si zvolit spuštění Open Web Calendar s Dockerem. Kompilace, běh a aktualizace jsou [dokumentovány zde](../docker).
de: Wenn Du deinen eigenen Serer aufsetzen willst, dann kannst du auch Docker verwenden. Bauen, starten und Updates sind [hier beschrieben](../docker).
eo: Se vi prizorgas vian propran servilon, vi povas disponigi la Malfermitan Retan Kalendaron per Docker. [Jen paŝoj](../docker) por disponigo kaj ĝisdatigo en Docker.
es: Si ejecutas tu propio servidor, puedes optar por ejecutar Open Web Calender con Docker. La compilación, ejecución y actualización están [documentadas aquí](../docker).

source: **Choose a hoster.** These are listed below.
cs: **Vyberte hostitele.** Jsou uvedeny níže.
de: **Wähle einen Dienstleister** Mehrere sind unten gelistet.
eo: **Elektu gastiganton.** Jen listo.
es: ** Elige un proveedor de alojamiento. ** Estos se enumeran a continuación.

source: [**Read about Configuration**](../configure).
de: [**Lies, wie man den Server anpasst**](../configure).
eo: [**Legi pri agordado**](../configure).
es: [**Leer sobre configuración**](../configure).

source: You can choose to run the Open Web Calendar installed as a Python package from PyPI. To do this, have a look at [the documentation](../pypi).
de: Du kannst den Offenen Web-Kalender auch als Python-Paket von PyPI installieren und starten. Sieh die [Dokumentation dazu an](../pypi).
es: Puedes optar por ejecutar el calendario web abierto instalado como un paquete de Python desde PyPI. Para ello, consulta [la documentación](../pypi).
