Repository: niccokunzmann/open-web-calendar
Catalog: open_web_calendar/translations/*/LC_MESSAGES/dev/api.md.po
Languages: eo, es, nl, sk, ta, uk

source: The API of the Open Web Calendar allows more customization than the configuration page.
eo: La aplikprograma interfaco de la Malfermita Reta Kalendaro ebligas plian adaptadon ol la agorda paĝo.
es: La API del Calendario web abierto permite más personalización que la página de configuración.
nl: De API van Open Web Calendar staat meer configuratieopties toe dan de configuratiepagina.
sk: API Open Web Calendar umožňuje viac prispôsobenie ako konfigurácia stránky.
ta: திறந்த வலை காலெண்டரின் பநிஇ உள்ளமைவு பக்கத்தை விட தனிப்பயனாக்கலை அனுமதிக்கிறது.
uk: API відкритого веб-календаря дозволяє налаштувати більше, ніж сторінка конфігурації.

source: Generally, the Open Web Calendar is there to be used without restriction. You can use this API to customize the calendar on the fly.
eo: Ĝenerale, la Malfermita Reta Kalendaro estas uzebla sen restrikto. Vi povas uzi ĉi tiun API por adapti la kalendaron laŭbezone.
es: Generalmente, Calendario web abierto está ahí para usarse sin restricciones. Puedes utilizar esta API para personalizar el calendario sobre la marcha.
nl: In zijn algemeenheid kan Open Web Calendar zonder restricties gebruikt worden. U kunt deze API gebruiken om kalenders ad hoc aan te passen.
sk: Všeobecne platí, že Open Web Calendar je používaný bez obmedzenia. Toto API môžete použiť na prispôsobenie kalendára na letáku.
ta: பொதுவாக, திறந்த வலை காலெண்டர் கட்டுப்பாடு இல்லாமல் பயன்படுத்தப்பட வேண்டும். பறக்கும்போது காலெண்டரைத் தனிப்பயனாக்க இந்த பநிஇ ஐப் பயன்படுத்தலாம்.
uk: Загалом відкритий веб-календар можна використовувати без обмежень. Ви можете використовувати цей API, щоб налаштувати календар на льоту.

source: This section can be of use if one of these applies:
eo: Ĉi tiu paragrafo povas esti tial utila, kial:
es: Esta sección puede serle útil si se da alguna de estas circunstancias:
nl: Deze sectie kan interessant zijn voor u als een van deze opties van toepassing is:
sk: Táto časť môže byť použitá, ak jeden z nich platí:
ta: இவற்றில் ஒன்று பொருந்தினால் இந்த பிரிவு பயன்படுகிறது:
uk: Цей розділ може бути корисним, якщо застосовується одне з наведеного нижче:

source: You are a web developer who wants to embed the Open Web Calendar.
eo: Vi estas retprogramisto, kiu volas enmeti la Malfermitan Retan Kalendaron.
es: Eres un desarrollador web que desea integrar el Calendario web abierto.
nl: U bent een web-ontwikkelaar die Open Web Calendar wil integreren.
sk: Ste web developer, ktorý chce vložiť Open Web Calendar.
ta: நீங்கள் திறந்த வலை காலெண்டரை உட்பொதிக்க விரும்பும் வலை உருவாக்குநர்.
uk: Ви веб-розробник, який хоче вставити Open Web Calendar.

source: You want to exploit the full flexibility, not just what is exposed on the configuration page.
eo: Vi volas ekspluati la plenan flekseblecon, ne nur tion, kio estas havebla sur la agorda paĝo.
es: Quieres explotar toda la flexibilidad, no solo lo que se expone en la página de configuración.
nl: U wilt volledige vrijheid in flexibiliteit, niet alleen wat getoond wordt op de configuratiepagina.
sk: Chcete využiť plnú flexibilitu, nie len to, čo je vystavené na stránke konfigurácie.
ta: உள்ளமைவு பக்கத்தில் அம்பலப்படுத்தப்படுவது மட்டுமல்லாமல், முழு நெகிழ்வுத்தன்மையையும் பயன்படுத்த விரும்புகிறீர்கள்.
uk: Ви хочете використовувати повну гнучкість, а не лише те, що відкрито на сторінці конфігурації.

source: You want to use JavaScript to dynamically generate the calendar design and options.
eo: Vi volas uzi JavaScript por dinamike generi la kalendarajn dezajnon kaj opciojn.
es: Deseas utilizar JavaScript para generar dinámicamente el diseño y las opciones del calendario.
nl: U wilt JavaScript gebruiken om alle kalenderontwerpen en opties dynamisch te genereren.
sk: Chcete používať JavaScript dynamicky generovať dizajn kalendára a možnosti.
ta: காலண்டர் வடிவமைப்பு மற்றும் விருப்பங்களை மாறும் வகையில் சாவாச்கிரிப்ட் பயன்படுத்த விரும்புகிறீர்கள்.
uk: Ви хочете використовувати JavaScript для динамічного створення дизайну та параметрів календаря.

source: You want to extend the functionality of the Open Web Calendar.
eo: Vi volas pliigi la funkciojn de la Malfermita Reta Kalendaro.
es: Deseas ampliar las funciones de Calendario web abierto.
nl: U wilt de functionaliteit uitbreiden van Open Web Calendar.
sk: Chcete rozšíriť funkčnosť Open Web Calendar.
ta: திறந்த வலை காலெண்டரின் செயல்பாட்டை நீட்டிக்க விரும்புகிறீர்கள்.
uk: Ви хочете розширити функціональність відкритого веб-календаря.

source: You want to use the Open Web Calendar as a proxy to request JSON events for your self-made event feed.
eo: Vi volas uzi la Malfermitan Retan Kalendaron kiel perilon por peti JSON-eventojn por via propra eventolisto.
es: Deseas utilizar Calendario web abierto como proxy para solicitar eventos JSON para tu fuente de eventos de creación propia.
nl: U wilt Open Web Calendar gebruiken als een proxy om gebeurtenissen in JSON voor uw zelfgemaakte gebeurtenissen feed te gebruiken.
sk: Chcete použiť Open Web Calendar ako proxy požiadať JSON udalosti pre vaše vlastné akcie krmivo.
ta: உங்கள் தன்வய தயாரிக்கப்பட்ட நிகழ்வு ஊட்டத்திற்கு சாதொபொகு நிகழ்வுகளைக் கோர திறந்த வலை காலெண்டரை ப்ராக்சியாகப் பயன்படுத்த விரும்புகிறீர்கள்.
uk: Ви хочете використовувати відкритий веб-календар як проксі-сервер для запиту подій JSON для вашої власноруч створеної стрічки подій.

source: Endpoints
eo: Finpunktoj
es: Punto final de comunicación
sk: Endpointy
ta: முனைப்புள்ளிகள்
uk: Кінцеві точки

source: The basic parameters are the same at these endpoints:
eo: La bazaj parametroj estas samaj ĉe la jenaj finpunktoj:
es: Los parámetros básicos son los mismos en estos puntos finales:
nl: De standaardparameters zijn gelijk bij deze endpoints:
sk: Základné parametre sú rovnaké v týchto bodoch:
ta: இந்த இறுதி புள்ளிகளில் அடிப்படை அளவுருக்கள் ஒரே மாதிரியானவை:
uk: Основні параметри однакові в цих кінцевих точках:

source: `/index.html` - edit the calendar
eo: `/index.html` – modifi la kalendaron
es: `/index.html` - editar el calendario
nl: `/index.html` - wijzig de kalender
sk: `/index.html` - upraviť kalendár
ta: `/index.html` - காலெண்டரைத் திருத்தவும்
uk: `/index.html` - редагувати календар

source: `/about.html` - view the about page
eo: `/about.html` – vidi la paĝon de metainformoj
es: `/about.html` - ver la página acerca de
nl: `/about.html` - bekijk de "over" pagina
sk: `/about.html` - zobraziť stránku
ta: `/பற்றி. Html` - பற்றி பக்கத்தைக் காண்க
uk: `/about.html` - переглянути сторінку про

source: `/calendar.html` - view the calendar
eo: `/calendar.html` – vidi la kalendaron
es: `/calendar.html` - ver el calendario
sk: `/calendar.html` - zobraziť kalendár
ta: `/caleendar.html` - காலெண்டரைக் காண்க
uk: `/calendar.html` - переглянути календар

source: `/calendar.spec` - download the specification
eo: `/calendar.spec` – elŝuti la specifon
es: `/calendar.spec` - descargar las especificaciones
sk: `/calendar.spec` - stiahnuť špecifikácie
ta: `/காலெண்டர்.ச்பெக்` - விவரக்குறிப்பைப் பதிவிறக்கவும்
uk: `/calendar.spec` - завантажити специфікацію

source: `/calendar.ics` - subscribe to the ics file
eo: `/calendar.ics` – aboni la ics-dosieron
es: `/calendar.ics` - suscribirse al archivo ics
sk: `/calendar.ics` - prihlásiť sa k súboru ics
ta: `/caleendar.ics` - ICS கோப்பிற்கு குழுசேரவும்
uk: `/calendar.ics` - підписатися на файл ics

source: `/calendar.events.json` - FLEXIBLE - get the events as JSON Please note that you CAN use this but you cannot be sure that the JSON schema remains the same. If you want that, add tests.
eo: `/calendar.events.json` - FLEKSEBLA - ricevi la eventojn kiel JSON. Bonvolu noti, ke vi ja povas uzi tion, sed vi ne povas certigi, ke la JSON-skemo restas sama. Se vi deziras tion, aldonu testojn.
nl: `/calendar.events.json` - FLEXIBEL - ontvang de evenementen als een JSON. Wees er op verdacht dat u dit KUNT gebruiken, maar dat geen zekerheid gegeven kan worden dat het JSON schema ongewijzigd blijft. Indien u dit wilt, dan dient u testen toe te voegen.
sk: `/calendar.events.json` - FLEXIBLE - dostať udalosti ako JSON Upozorňujeme, že to môžete použiť, ale nemôžete si byť istí, že JSON schema zostáva rovnaký. Ak to chcete, pridajte testy.
ta: `/galendar.events.json` - நெகிழ்வான - சாதொபொகு என நிகழ்வுகளைப் பெறுங்கள் தயவுசெய்து இதைப் பயன்படுத்தலாம் என்பதை நினைவில் கொள்க, ஆனால் சாதொபொகு ச்கீமா அப்படியே இருக்கிறது என்பதை நீங்கள் உறுதியாக நம்ப முடியாது. நீங்கள் விரும்பினால், சோதனைகளைச் சேர்க்கவும்.
uk: `/calendar.events.json` - ГНУЧКИЙ – отримуйте події як JSON. Зауважте, що ви МОЖЕТЕ використовувати це, але не можете бути впевнені, що схема JSON залишиться незмінною. Якщо ви цього хочете, додайте тести.

source: `timezone=UTC` - the timezone that you need to display the events in
eo: `timezone=UTC` – la horzono, laŭ kiu la eventoj estas montrotaj
nl: `timezone=UTC` - de tijdzone waarin de evenementen getoond worden
sk: `timezone=UTC` - časové pásmo, ktoré musíte zobraziť udalosti v
ta: `Timezone = UTC` - நீங்கள் நிகழ்வுகளைக் காண்பிக்க வேண்டிய நேர மண்டலம்
uk: `timezone=UTC` - часовий пояс, у якому потрібно відображати події

source: `from=YYYY-MM-DD` - the start of the period in which events happen (inclusive)
eo: `from=JJJJ-MM-TT` – la komenco de la periodo de eventoj (inkluziva)
es: `from=YYYY-MM-DD` - el inicio del periodo en el que ocurren los eventos (inclusive)
nl: `from=YYYY-MM-DD` - de start van de periode waarin evenementen plaatsvinden (inclusief)
sk: `od=YYYYYY-MM-DD` - začiatok obdobia, v ktorom sa udalosti stávajú (inclusive)
ta: `from = yyyy-mm-dd`-நிகழ்வுகள் நடக்கும் காலத்தின் தொடக்க (உள்ளடக்கியது)
uk: `from=YYYY-MM-DD` - початок періоду, в якому відбуваються події (включно)

source: `to=YYYY-MM-DD` - the end of the period in which events happen (exclusive)
eo: `to=JJJJ-MM-TT` – la fino de la periodo de eventoj (ekskluziva)
es: `to=YYYY-MM-DD` - el final del periodo en el que ocurren los eventos (exclusivo)
nl: `to=YYYY-MM-DD` - het eind van de periode waarin evenementen plaatsvinden (exclusief)
sk: `to=YYYYY-MM-DD` - koniec obdobia, v ktorom sa udalosti stávajú (exkluzívne)
ta: `to = yyyy-mm-dd`-நிகழ்வுகள் நடக்கும் காலத்தின் முடிவு (பிரத்தியேக)
uk: `to=YYYY-MM-DD` - кінець періоду, в якому відбуваються події (виключно)

source: Parameters
eo: Parametroj
es: Parámetros
sk: Parametry
ta: அளவுருக்கள்
uk: Параметри

source: All configuration parameters are described sufficiently in the [default_specification]. That is the reference. E.g. if you find the parameter `title` in the [default_specification], you have several options:
eo: Ĉiuj agordaj parametroj estas priskribitaj sufiĉe en la [default_specification]. Tiu estas la manlibro. Ekz. se vi trovas la parametron `title` en la [default_specification], vi havas plurajn opciojn:
es: Todos los parámetros de configuración se describen suficientemente en [default_specification]. Esa es la referencia. Por ejemplo, si encuentras el parámetro `title` en [default_specifications], tiene varias opciones:
nl: Alle configuratieparameters zijn voldoende beschreven in de [default_specification]. Dat is de referentie. Bijv. indien u de parameter `title` vind in de [default_specificatie], heeft u verschillende opties:
sk: Všetky parametre konfigurácie sú dostatočne opísané v [predvolené_specification]. To je odkaz. E.g. Ak nájdete parameter `title` v [predvolené_specification], máte niekoľko možností:
uk: Усі параметри конфігурації достатньо детально описано в [default_specification]. Це посилання. наприклад якщо ви знайдете параметр `title` в [default_specification], у вас є кілька варіантів:

source: Adding Parameters
eo: Aldoni parametrojn
es: Cómo añadir parámetros
nl: Toevoegen van parameters
sk: Pridávanie parametrov
ta: அளவுருக்களைச் சேர்ப்பது
uk: Додавання параметрів

source: Add the parameter with a default value to the [default_specification]
eo: Metu la parametron kun implicita valoro al la [default_specification]
es: Añade el parámetro con un valor por defecto a la [default_specification]
nl: Voeg de parameter toe met een standaardwaarde aan de [default_specification]
sk: Pridajte parameter s predvolenou hodnotou [predvolené_specification]
ta: இயல்புநிலை மதிப்புடன் அளவுருவை [இயல்புநிலை_ விவரக்குறிப்பு] இல் சேர்க்கவும்
uk: Додайте параметр із значенням за замовчуванням до [default_specification]

source: Add an implementation, depending on its use in the `app.py` or the templates of the JavaScript files. The specification is already available in all of them to use.
eo: Aldonu kodon, depende de ĝia uzo en la dosiero `app.py ` aŭ en la ŝablonoj de la JavaScript-dosieroj. La specifo jam estas havebla en ĉiuj el ili por uzado.
es: Añadir una implementación, dependiendo de su uso en `app.py` o a las plantillas de los archivos JavaScript. La especificación ya está disponible en todos ellos para su uso.
nl: Voeg een implementatie toe, afhankelijk van het gebruik in de `app.py` of de sjablonen van de JavaScript bestanden. De specificatie is direct overal beschikbaar om te gebruiken.
sk: Pridajte implementáciu, v závislosti od jeho použitia v `app.py` alebo šablóny JavaScriptových súborov. Špecifikácia je už k dispozícii vo všetkých z nich použiť.
ta: `App.py` அல்லது சாவாச்கிரிப்ட் கோப்புகளின் வார்ப்புருக்கள் ஆகியவற்றில் அதன் பயன்பாட்டைப் பொறுத்து ஒரு செயலாக்கத்தைச் சேர்க்கவும். விவரக்குறிப்பு ஏற்கனவே பயன்படுத்துவதற்கு ஏற்கனவே கிடைக்கிறது.
uk: Додайте реалізацію залежно від її використання в `app.py` або шаблонах файлів JavaScript. Специфікація вже доступна для використання в усіх них.

source: Compiling the Specification
eo: Kompili la specifon
es: Compilación de la especificación
nl: De specificatie compileren
sk: Dodržiavanie špecifikácie
ta: விவரக்குறிப்பை தொகுத்தல்
uk: Складання специфікації

source: Specification in the Calendar
eo: Specifo en la kalendaro
es: Especificación en el calendario
nl: Specificatie in de kalender
sk: Špecifikácia v kalendári
ta: காலெண்டரில் விவரக்குறிப்பு
uk: Уточнення в Календарі

source: Specification in the Index Page
eo: Specifo en la indeksa paĝo
es: Especificación en la página Index
nl: Specificatie in de Indexpagina
sk: Špecifikácia v sekcii Index
ta: குறியீட்டு பக்கத்தில் விவரக்குறிப்பு
uk: Специфікація на сторінці покажчика

source: Architecture
eo: Arĥitekturo
es: Arquitectura
nl: Architectuur
sk: Architektúra
ta: கட்டிடக்கலை
uk: Архітектура

source: Below, you can find a picture of the architecture.
eo: Jen diagramo de la arĥitekturo.
es: A continuación encontraras una imagen de la arquitectura.
nl: Hieronder kunt u een schematische weergave zien van de architectuur.
sk: Nižšie nájdete obrázok architektúry.
ta: கீழே, நீங்கள் கட்டிடக்கலையின் படத்தைக் காணலாம்.
uk: Нижче ви можете знайти зображення архітектури.

source: The base of a calendar is the specification, given in the various forms. This specification influences all the steps.
eo: La bazo de kalendaro estas la specifo, donita en diversaj formoj. Ĉi tiu specifo influas ĉiujn paŝojn.
es: La base de un calendario son las especificaciones, dadas en sus diversas formas. Estas especificaciones influyen en todos los pasos.
nl: De basis van de kalender is de specificatie, in de verschillende vormen. Deze specificatie be√Ønvloedt alle stappen.
sk: Základ kalendára je špecifikácia, vzhľadom na rôzne formy. Táto špecifikácia ovplyvňuje všetky kroky.
ta: ஒரு காலெண்டரின் அடிப்படை என்பது பல்வேறு வடிவங்களில் கொடுக்கப்பட்டுள்ள விவரக்குறிப்பாகும். இந்த விவரக்குறிப்பு அனைத்து படிகளையும் பாதிக்கிறது.
uk: Основою календаря є специфікація, подана в різних формах. Ця специфікація впливає на всі кроки.

source: After the specification is compiled, the calendar (ics) files are downloaded from the locations on the Internet.
eo: Post kiam la specifo estas kompilita, la kalendaraj (.ics-) dosieroj estas elŝutitaj de la lokoj sur Interreto.
es: Una vez compilado las condiciones, los archivos del calendario (ics) se descargan de las ubicaciones de Internet.
nl: Nadat de specificatie is gecompileerd worden de kalenderbestanden (ics) gedownload van de locaties op het internet.
sk: Po zostavení špecifikácie, kalendár (ics) súbory sú stiahnuté z miest na internete.
ta: விவரக்குறிப்பு தொகுக்கப்பட்ட பிறகு, காலண்டர் (ஐசிஎச்) கோப்புகள் இணையத்தில் உள்ள இடங்களிலிருந்து பதிவிறக்கம் செய்யப்படுகின்றன.
uk: Після того, як специфікація складена, файли календаря (ics) завантажуються з місць в Інтернеті.

source: From the calendar files, the events are generated.
eo: El la kalendaraj dosieroj, la eventoj estas generitaj.
es: A partir de los archivos del calendario se generan los eventos.
nl: Evenementen worden gegenereerd vanuit de kalenderbestanden.
sk: Z kalendárových súborov sa vygenerujú udalosti.
ta: காலண்டர் கோப்புகளிலிருந்து, நிகழ்வுகள் உருவாக்கப்படுகின்றன.
uk: З файлів календаря генеруються події.

source: Then, different views are chosen to display the events.
eo: Poste, diversaj vidoj estas elektitaj por elmontri la eventojn.
es: A continuación, se eligen diferentes vistas para mostrar los eventos.
nl: Dan worden verschillende weergaven gekozen om evenementen te tonen.
sk: Potom sa vyberajú rôzne názory na zobrazenie udalostí.
ta: பின்னர், நிகழ்வுகளைக் காண்பிக்க வெவ்வேறு காட்சிகள் தேர்ந்தெடுக்கப்படுகின்றன.
uk: Потім для відображення подій вибираються різні види.

source: In the end, these lead to HTML and style changes of the calendar website.
eo: Fine, tio kaŭzas HTML-ajn kaj stilajn ŝanĝojn de la kalendara retpaĝo.
es: Al final, esto conlleva cambios en el HTML y el estilo de la página web del calendario.
nl: Uiteindelijk leiden deze HTML en stijlwijzigingen tot wijzigingen van de kalenderwebsite.
sk: Na konci, tieto vedú k HTML a štýlu zmeny webovej stránky kalendára.
ta: முடிவில், இவை காலண்டர் வலைத்தளத்தின் உஉகுமொ மற்றும் பாணி மாற்றங்களுக்கு வழிவகுக்கும்.
uk: Зрештою, це призводить до змін HTML і стилю веб-сайту календаря.

source: In the real application, these steps are bit bit mixed up and unordered or omitted but this explains simply the basic, initial idea behind the event processing.
eo: En la reala programo, tiuj paŝoj estas iom intermiksitaj kaj malordigitaj aŭ pretersaltitaj, sed tio klarigas simple la bazan principon pri la traktado de la eventoj.
es: En la aplicación real, estos pasos están un poco mezclados y desordenados u omitidos, pero esto explica simplemente la idea básica e inicial detrás del procesamiento de eventos.
nl: In de echte toepassing zijn deze stappen enigszins door elkaar, ongesorteerd of soms weggelaten, maar dit legt op een eenvoudige manier het basisidee achter de evenementverwerking uit.
sk: V skutočnej aplikácii sú tieto kroky trochu zmiešané a neobjednané alebo vynechané, ale to vysvetľuje jednoducho základnú, počiatočnú myšlienku za spracovanie udalostí.
ta: உண்மையான பயன்பாட்டில், இந்த படிகள் பிட் பிட் கலப்பு மற்றும் வரிசைப்படுத்தப்படாதவை அல்லது தவிர்க்கப்பட்டவை, ஆனால் இது நிகழ்வு செயலாக்கத்தின் பின்னால் உள்ள அடிப்படை, ஆரம்ப யோசனையை விளக்குகிறது.
uk: У реальній програмі ці кроки трохи переплутані, невпорядковані або опущені, але це просто пояснює основну початкову ідею обробки подій.

source: ![architecture](/assets/img/architecture.svg)
eo: ![arĥitekturo](/assets/img/architecture.svg)
sk: ![architecture](/asets/img/architecture.svg)
uk: ![архітектура](/assets/img/architecture.svg)

source: Query Parameter
eo: Parametro de informpeto
es: Parámetros de consulta
sk: Požiadavky Para
ta: வினவல் அளவுரு
uk: Параметр запиту

source: Change the title in a YAML specification:
eo: Ŝanĝi la titolon per YAML-specifo:
es: Cambiar el título en una especificación YAML:
nl: Wijzig de titel in een YAML specificatie:
sk: Zmena titulu v špecifikácie YAML:
ta: YAML விவரக்குறிப்பில் தலைப்பை மாற்றவும்:
uk: Змініть назву в специфікації YAML:

source: Change the title in a JSON specification:
eo: Ŝanĝi la titolon per JSON-specifo:
es: Cambiar el título en una especificación JSON:
nl: Wijzig de titel in een JSON specificatie:
sk: Zmena titulu v špecifikácie JSON:
ta: சாதொபொகு விவரக்குறிப்பில் தலைப்பை மாற்றவும்:
uk: Змініть назву в специфікації JSON:

source: Change the title in a query parameter:
eo: Ŝanĝi la titolon per parametro en la informpeto:
es: Cambiar el título en un parámetro de consulta:
nl: Wijzig de title in een query-parameter:
sk: Zmena titulu v kalóriu parameter:
ta: வினவல் அளவுருவில் தலைப்பை மாற்றவும்:
uk: Змініть заголовок у параметрі запиту:

source: Additional parameters are required for `/calendar.events.json`:
es: Parámetros adicionales requeridos para `/calendario.eventos.json` :
nl: Aanvullende parameters zijn verplicht voor `/calendar.events.json`:
ta: `/Calendar.events.json` க்கு கூடுதல் அளவுருக்கள் தேவை:
uk: Для `/calendar.events.json` необхідні додаткові параметри:

source: You can change the calendar behavior and looks with parameters. If the same parameter is specified in different places, the earlier place listed below has the highest precedence. These are the places to specify parameters:
nl: U kunt het standaard gedrag en weergave aanpassen via parameters. Als dezelfde parameter gespecificeerd is op meerdere plekken, zal de plek waar die voor het eerste gedefinieerd is voorrang krijgen. Dit zijn de plekken waar de parameters gespecificeerd worden:
ta: நீங்கள் காலெண்டர் நடத்தையை மாற்றலாம் மற்றும் அளவுருக்கள் மூலம் தோற்றமளிக்கலாம். அதே அளவுரு வெவ்வேறு இடங்களில் குறிப்பிடப்பட்டால், கீழே பட்டியலிடப்பட்டுள்ள முந்தைய இடம் மிக உயர்ந்த முன்னுரிமையைக் கொண்டுள்ளது. அளவுருக்களைக் குறிப்பிடுவதற்கான இடங்கள் இவை:
uk: Ви можете змінити поведінку та вигляд календаря за допомогою параметрів. Якщо один і той самий параметр указано в різних місцях, найвищий пріоритет матиме попереднє місце, указане нижче. Ось місця для визначення параметрів:

source: Query parameters
ta: வினவல் அளவுருக்கள்
uk: Параметри запиту

source: All parameters to the calendar url are put into the specification. The query parameters have the highest precedence.
nl: Alle parameters naar de kalender-URL worden in de specificatie gezet. De query-parameters hebben de hoogste prioriteit.
ta: காலண்டர் முகவரி க்கான அனைத்து அளவுருக்களும் விவரக்குறிப்பில் வைக்கப்படுகின்றன. வினவல் அளவுருக்கள் மிக உயர்ந்த முன்னுரிமையைக் கொண்டுள்ளன.
uk: Усі параметри URL-адреси календаря містяться в специфікації. Параметри запиту мають найвищий пріоритет.

source: If you specify this query parameter, the editor configuration is loaded from this url, too. Query parameters are still more important than what is written in this file. The source format can be YAML or JSON.
nl: Indien u deze query-parameter specificeert wordt ook de editor-configuratie geladen vanaf deze URL. Query-parameters zijn nog steeds belangrijker dan wat is opgenomen in dit bestand. Het bronformaat can YAML of JSON zijn.
ta: இந்த வினவல் அளவுருவை நீங்கள் குறிப்பிட்டால், இந்த முகவரி இலிருந்து எடிட்டர் உள்ளமைவு ஏற்றப்படுகிறது. இந்த கோப்பில் எழுதப்பட்டதை விட வினவல் அளவுருக்கள் இன்னும் முக்கியமானது. மூல வடிவம் YAML அல்லது சாதொபொகு ஆக இருக்கலாம்.
uk: Якщо вказати цей параметр запиту, конфігурація редактора також завантажується з цієї URL-адреси. Параметри запиту все ще важливіші за те, що написано в цьому файлі. Вихідним форматом може бути YAML або JSON.

source: This is intended for developers and Python-internal.
nl: Dit is bedoeld voor ontwikkelaars en Python-internal.
ta: இது உருவாக்குபவர்கள் மற்றும் பைதான்-இன்டர்னல் ஆகியவற்றிற்காக வடிவமைக்கப்பட்டுள்ளது.
uk: Це призначено для розробників і внутрішніх Python.

source: This is an optional environment variable. Please read more about it in the [Server Configuration](../../host/configure#owc_specification).
nl: Dit is een optionele omgevingsvariabele. Leest u meer hierover in de [Server Configuratie](../../host/configure#owc_specification).
uk: Це необов’язкова змінна середовища. Будь ласка, прочитайте більше про це в [Конфігурації сервера](../../host/configure#owc_specification).
