Repository: niccokunzmann/open-web-calendar
Catalog: open_web_calendar/translations/*/LC_MESSAGES/dev/api.md.po
Languages: eo, es, nl, sk, ta, uk

source: This file contains the default parameters. They must not be hard-coded in the source code. All parameters are listed and documented there so this file can be used for reference. Do not modify this file, instead use the `OWC_SPECIFICATION` environment variable.
nl: Dit bestand bevat de standaard parameters. Deze mogen niet hard-coded voorkomen in de broncode. Alle parameters zijn daar opgenomen en gedocumenteerd, dus kan dit bestand als referentie worden gebruikt. Wijzig dit bestand niet, maar maak gebruik van de `OWC_SPECIFICATION` omgevingsvariabele.
ta: இந்த கோப்பில் இயல்புநிலை அளவுருக்கள் உள்ளன. அவை மூலக் குறியீட்டில் கடினமாக குறியிடப்படக்கூடாது. அனைத்து அளவுருக்கள் பட்டியலிடப்பட்டு ஆவணப்படுத்தப்பட்டுள்ளன, எனவே இந்த கோப்பை குறிப்புக்கு பயன்படுத்தலாம். இந்த கோப்பை மாற்ற வேண்டாம், அதற்கு பதிலாக `OWC_SPECIFICATION` சூழல் மாறியைப் பயன்படுத்தவும்.
uk: Цей файл містить параметри за замовчуванням. Вони не повинні бути жорстко закодовані у вихідному коді. Усі параметри перераховані та задокументовані там, тому цей файл можна використовувати для довідки. Не змінюйте цей файл, натомість використовуйте змінну середовища `OWC_SPECIFICATION`.

source: If you add a new parameter as a developer:
nl: Indien u als ontwikkelaar een nieuwe parameter toevoegt:
ta: டெவலப்பராக புதிய அளவுருவைச் சேர்த்தால்:
uk: Якщо ви додаєте новий параметр як розробник:

source: Add tests in [features/configure-the-calendar.feature] to check that the calendar responds to the feature.
nl: Voeg tests toe [features/configure-the-calendar.feature] om te controleren of de kalender juist functioneert.
uk: Додайте тести в [features/configure-the-calendar.feature], щоб перевірити, чи календар відповідає функції.

source: Add tests in [features/edit-the-calendar.feature] to make sure that the parameter can be used when a calendar is edited.
nl: Voeg tests toe [features/edit-the-calendar.feature] om zeker te weten dat de parameter gebruikt kan worden wanneer een kalender wordt gewijzigd.
uk: Додайте тести в [features/edit-the-calendar.feature], щоб переконатися, що параметр можна використовувати під час редагування календаря.

source: [app.py][app.py-81] compiles the specification from the given parameters in `get_specification()`. In the [template][dhtmlx-23] you can access the specification through the `specification` variable. The specification is available to JavaScript as the `specification` variable.
nl: [app.py][app.py-81] compileert de specificatie van de gegeven parameters in `get_specification()`. In het [sjabloon][dhtmlx-23] kunt u de specificatie benaderen via de `specification` variabele. De specificatie is beschikbaar in JavaScript als de `specification` variabele.
uk: [app.py][app.py-81] компілює специфікацію з заданих параметрів у `get_specification()`. У [template][dhtmlx-23] ви можете отримати доступ до специфікації через змінну `specification`. Специфікація доступна для JavaScript як змінна `specification`.

source: The default specification is available before the calendar is built via JavaScript in the `configuration.default_specification` variable. There is a [getSpecification()] function which created the specification from the inputs. Generally, the `specification` variable should be used.
nl: De standaardspecificatie is beschikbaar voordat de kalender opgebouwd wordt door JabaScript in de `configuration.default_specification` variabele. Er is een [getSpecification()] functie die de specificatie maakt op basis van de invoer. In het algemeen, de `specification` variabele zal gebruikt moeten worden.
uk: Специфікація за замовчуванням доступна до створення календаря за допомогою JavaScript у змінній `configuration.default_specification`. Існує функція [getSpecification()], яка створює специфікацію з вхідних даних. Загалом слід використовувати змінну `specification`.

source: API
eo: Aplikprograma interfaco
ta: பநிஇ

source: YAML
ta: யம்ல்

source: JSON
ta: சேசன்

source: `/calendar.json` - information about the calendar and the content as JSON
nl: `/calendar.json` - informatie over de kalender en de inhoud als JSON

source: [JavaScript Customization](../javascript)
nl: [JavaScript-aanpassing](../javascript)

source: Add tests in [features/configure-the-calendar.feature](https://github.com/niccokunzmann/open-web-calendar/tree/master//features/configure-the-calendar.feature) to check that the calendar responds to the feature.
eo: Aldonu testojn en [features/configure-the-calendar.feature](https://github.com/niccokunzmann/open-web-calendar/tree/master//features/configure-the-calendar.feature) por kontroli, ĉu la kalendaro respondas al la trajto.
es: Añade pruebas en [features/configure-the-calendar.feature](https://github.com/niccokunzmann/open-web-calendar/tree/master//features/configure-the-calendar.feature) para comprobar que el calendario responde a la función.
sk: Pridajte testy v [features/configure-the-calendar.feature](https://github.com/niccokunzmann/open-web-calendar/tree/master/features/configure-the-calendar.feature) skontrolovať, že kalendár reaguje na funkciu.

source: Add tests in [features/edit-the-calendar.feature](https://github.com/niccokunzmann/open-web-calendar/tree/master//features/edit-the-calendar.feature) to make sure that the parameter can be used when a calendar is edited.
eo: Aldonu testojn en [features/edit-the-calendar.feature](https://github.com/niccokunzmann/open-web-calendar/tree/master//features/edit-the-calendar.feature) por certigi, ke la parametro estas uzebla, kiam kalendaro estas modifita.
es: Añadir pruebas en [features/edit-the-calendar.feature](https://github.com/niccokunzmann/open-web-calendar/tree/master//features/edit-the-calendar.feature) para asegurarse de que el parámetro se puede utilizar cuando se edita un calendario.
sk: Pridajte testy v [features/edit-the-calendar.feature](https://github.com/niccokunzmann/open-web-calendar/tree/master/features/edit-the-calendar.feature) uistite sa, že parameter môže byť použitý pri editácii kalendára.

source: [app.py](https://github.com/niccokunzmann/open-web-calendar/blob/85a72dab4561e250aec69b5ad7c3de074eefa1e8/app.py#L81) compiles the specification from the given parameters in `get_specification()`. In the [template](https://github.com/niccokunzmann/open-web-calendar/blob/85a72dab4561e250aec69b5ad7c3de074eefa1e8/templates/calendars/dhtmlx.html#L23) you can access the specification through the `specification` variable. The specification is available to JavaScript as the `specification` variable.
eo: [app.py](https://github.com/niccokunzmann/open-web-calendar/blob/85a72dab4561e250aec69b5ad7c3de074eefa1e8/app.py#L81) kompilas la specifon el la donitaj parametroj en `get_specification()`. En la [ŝablono](https://github.com/niccokunzmann/open-web-calendar/blob/85a72dab4561e250aec69b5ad7c3de074eefa1e8/templates/calendars/dhtmlx.html#L23), vi povas legi la specifon per la variablo `specification`. La specifo estas havebla en JavaScript per la variablo `specification`.
es: [app.py](https://github.com/niccokunzmann/open-web-calendar/blob/85a72dab4561e250aec69b5ad7c3de074eefa1e8/app.py#L81) compila la especificación a partir de los parámetros dados en `get_specification()`. En [template](https://github.com/niccokunzmann/open-web-calendar/blob/85a72dab4561e250aec69b5ad7c3de074eefa1e8/templates/calendars/dhtmlx.html#L23) puedes acceder a la especificación a través de la variable `specification`. La especificación está disponible para JavaScript como la variable `specification`.
sk: [app.py](https://github.com/niccokunzmann/open-web-calendar/blob/85a72dab4561e250aec69b5ad7c3de074efa1e8/app.py#L81) zostavuje špecifikácie z uvedených parametrov v [X174]getation (X194X)[X)[X (X) V [premýšľa](https://github.com/niccokunzmann/open-web-calendar/blob/85a72dab4561e250aec69b5ad7c3de074efa1e8/ uvažujes/calendars/dhtml#L môžete získať prístup k špecifikácie [394X premennej] (X). Špecifikácia je k dispozícii na JavaScript ako `specification` premenná.

source: The default specification is available before the calendar is built via JavaScript in the `configuration.default_specification` variable. There is a [getSpecification()](https://github.com/niccokunzmann/open-web-calendar/blob/85a72dab4561e250aec69b5ad7c3de074eefa1e8/static/js/index.js#L93) function which created the specification from the inputs. Generally, the `specification` variable should be used.
eo: La implicita specifo estas havebla antaŭ ol la kalendaro estas konstruita per JavaScript en la variablo `configuration.default_specification`. Ekzistas funkcio [getSpecification()](https://github.com/niccokunzmann/open-web-calendar/blob/85a72dab4561e250aec69b5ad7c3de074eefa1e8/static/js/index.js#L93), kiu kreas de la enigaĵoj la specifon. Ĝenerale, oni uzu la variablon `specification`.
es: La especificación por defecto está disponible antes de construir el calendario a través de JavaScript en la variable `configuration.default_specification`. Existe una función [getSpecification()](https://github.com/niccokunzmann/open-web-calendar/blob/85a72dab4561e250aec69b5ad7c3de074eefa1e8/static/js/index.js#L93) que crea la especificación a partir de las entradas. Generalmente, se debe utilizar la variable `specification`.
sk: Predvolená špecifikácia je k dispozícii pred kalendárom je postavený cez JavaScript v ` konfigurácii. Predvolené_specification` premenné. Tam je [getSpecification()](https://github.com/niccokunzmann/open-web-calendar/blob/85a72dab4561e250aec69b5ad7c3de074efa1e8/static/js/index.js#L93) funkcia, ktorá vytvorila špecifikáciu z vstupov. Všeobecne platí, že `specification` premenná by sa mala používať.
